/*
SQLyog Ultimate v12.5.0 (64 bit)
MySQL - 5.7.20 : Database - xh_hgy
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`xh_hgy` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `xh_hgy`;

/*Table structure for table `kb_batch_share` */

DROP TABLE IF EXISTS `kb_batch_share`;

CREATE TABLE `kb_batch_share` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `share_code` char(19) DEFAULT NULL COMMENT '分享编码',
  `project_code` char(19) DEFAULT NULL COMMENT '项目编码',
  `project_level` int(2) DEFAULT NULL COMMENT '项目等级',
  `file_codes` text COMMENT '分享文件编码数组',
  `share_date` date DEFAULT NULL COMMENT '分享日期yyyy-MM-dd',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `create_user_code` char(19) DEFAULT NULL COMMENT '创建人编码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

/*Data for the table `kb_batch_share` */

insert  into `kb_batch_share`(`id`,`share_code`,`project_code`,`project_level`,`file_codes`,`share_date`,`create_time`,`create_user_code`) values 
(1,'SHA2018071215521211','P201806291022080000',0,'F201806301444208715,F201806301513066890','2018-07-12','2018-07-12 10:20:14','17'),
(2,'SHA2018071409510601','P201806291022080000',0,'F201806301513066890','2018-07-14','2018-07-14 09:51:06','820032'),
(3,'SHA2018071615375080','P201806291022080000',0,'F201806301444208715,F201806301513066890','2018-07-16','2018-07-16 15:37:50','820032'),
(4,'SHA2018072516144411','P201806291022080000',0,'F201806280917563619,F201806280927034111,F201806281005196561','2018-07-25','2018-07-25 16:14:44','820032'),
(5,'SHA2018072518004699','P201806291022080000',0,'F201806280927034111,F201806281005196561','2018-07-25','2018-07-25 18:00:46','820032'),
(6,'SHA2018073115352328','P201807141613152269',0,'','2018-07-31','2018-07-31 15:35:23','820032');

/*Table structure for table `kb_dept` */

DROP TABLE IF EXISTS `kb_dept`;

CREATE TABLE `kb_dept` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `dept_code` char(19) DEFAULT NULL COMMENT '部门编号',
  `dept_name` varchar(32) DEFAULT NULL COMMENT '部门名称',
  `dept_level` int(4) DEFAULT NULL COMMENT '部门所属等级',
  `dept_parent_code` char(19) DEFAULT NULL COMMENT '父部门编号',
  `dept_status` char(1) DEFAULT NULL COMMENT '部门状态 1:正常 2：锁定 3：删除',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `un_dept_code` (`dept_code`),
  KEY `un_dept_parent_code` (`dept_parent_code`),
  KEY `un_create_user_code` (`create_user_code`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `kb_dept` */

insert  into `kb_dept`(`id`,`dept_code`,`dept_name`,`dept_level`,`dept_parent_code`,`dept_status`,`create_user_code`,`create_time`) values 
(1,'D201806230935390370','总部',1,NULL,'1','820032','2018-06-23 09:56:00'),
(2,'D201806230935390372','分厂',2,'D201806230935390370','1','820032','2018-06-23 09:56:03'),
(3,'D201806230935390373','部门',3,'D201806230935390372','1','820032','2018-06-23 09:56:05');

/*Table structure for table `kb_dic` */

DROP TABLE IF EXISTS `kb_dic`;

CREATE TABLE `kb_dic` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `dic_code` varchar(30) DEFAULT NULL COMMENT '编码',
  `dic_name` varchar(50) DEFAULT NULL COMMENT '名称',
  `dic_value` varchar(30) DEFAULT NULL COMMENT '值',
  `dic_parent_code` varchar(30) DEFAULT NULL COMMENT '父编码',
  PRIMARY KEY (`id`),
  KEY `un_dic_code` (`dic_code`),
  KEY `un_dic_parent_code` (`dic_parent_code`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `kb_dic` */

insert  into `kb_dic`(`id`,`dic_code`,`dic_name`,`dic_value`,`dic_parent_code`) values 
(1,'file_event_type','文件事件类型','WJSJLX',''),
(2,'DYZL','调研资料','DYZL','file_event_type'),
(3,'HYZL','会议资料','HYZL','file_event_type'),
(4,'GSXXZL','公司信息资料','GSXXZL','file_event_type'),
(5,'LSHYZL','临时会议资料','LSHYZL','file_event_type'),
(6,'file_event_level','文件事件级别','WJSJJB',NULL),
(7,'FCZY','非常重要','FCZY','file_event_level'),
(8,'ZY','重要','ZY','file_event_level'),
(9,'YB','一般','YB','file_event_level');

/*Table structure for table `kb_file_0` */

DROP TABLE IF EXISTS `kb_file_0`;

CREATE TABLE `kb_file_0` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id自增',
  `file_code` char(19) DEFAULT NULL COMMENT '文件编号 F+yyyyMMddHHmmss+4随机数',
  `file_name` varchar(32) DEFAULT NULL COMMENT '文件名称',
  `file_info` varchar(255) DEFAULT NULL COMMENT '文件信息',
  `file_type` varchar(12) DEFAULT NULL COMMENT '.png/.jpge/.cad/.doc/.docx/.xls…(统一小写)',
  `file_status` varchar(9) DEFAULT NULL COMMENT '删除:delete 在档：record 锁定：locked',
  `file_level` int(2) DEFAULT '0' COMMENT '0为根项目 用于限定开放的项目层级',
  `project_code` char(19) DEFAULT NULL COMMENT '项目格式 P+yyyyMMddHHmmss+4随机数',
  `file_event_type` varchar(10) DEFAULT NULL COMMENT '文件性质(事件)调研资料：DYZL,会议资料：HYZL,公司信息资料：GSXXZL',
  `file_event_level` varchar(10) DEFAULT NULL COMMENT '文件级别(事件)非常重要：FCZY,重要：ZY,一般：YB',
  `file_research_user_code` varchar(11) DEFAULT NULL COMMENT '调研人编码',
  `file_research_start_time` date DEFAULT NULL COMMENT '调研时间',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '员工编号',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_code` varchar(11) DEFAULT NULL COMMENT '更新人编码',
  `update_time` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `index_file_code` (`file_code`) USING BTREE,
  KEY `index_project_code` (`project_code`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=48 DEFAULT CHARSET=utf8;

/*Data for the table `kb_file_0` */

insert  into `kb_file_0`(`id`,`file_code`,`file_name`,`file_info`,`file_type`,`file_status`,`file_level`,`project_code`,`file_event_type`,`file_event_level`,`file_research_user_code`,`file_research_start_time`,`create_user_code`,`create_time`,`update_user_code`,`update_time`) values 
(5,'F201806221421466073','新海知识库数据库结构.xlsx','这是一个测试文件','.xlsx','record',0,'P201807141613152269','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:50:52','820032','2018-07-25 14:53:00'),
(6,'F201806221430024226','七分厂预警通知辅助系统_说明文档.docx','这是一个测试文件','.docx','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:22','820032','2018-07-25 14:53:01'),
(7,'F201806280902157192','4.3 关于MES系统审核会议纪要.docx','4.3 关于MES系统审核会议纪要','.docx','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:25','820032','2018-07-25 14:53:01'),
(8,'F201806280911096486','七分厂预警解决方案.docx','七分厂预警解决方案','.docx','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:27','820032','2018-07-25 14:53:02'),
(9,'F201806280914060626','七分厂MES系统整改会 180530V1.1.docx','七分厂MES系统整改会 180530V1.1','.docx','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:29','820032','2018-07-25 14:53:02'),
(10,'F201806280917563619','警报层级 0508.docx','预警层级','.docx','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:31','820032','2018-07-25 14:53:03'),
(11,'F201806280927034111','新海LOGO_login.png','PNG新海LOGO测试','.png','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:32','820032','2018-07-25 14:53:05'),
(12,'F201806281005196561','警报层级 0508.docx','撒啊撒大苏打撒','.docx','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:34','820032','2018-07-25 18:19:14'),
(14,'F201806290851405944','知识库数据结构demo.xls','测试跳转','.xls','record',0,'P201807141613152269','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:46','820032','2018-07-25 14:53:06'),
(30,'F201806300905048406','新海知识库数据库结构.xlsx','1231321','.xlsx','record',0,'P201807141613152269','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:49','820032','2018-07-25 14:53:06'),
(40,'F201807211037032228','file_extension_dwg.png','测试文件','.png','record',0,'P201807141613152269','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:51:51','820032','2018-07-25 14:53:07'),
(41,'F201807310843084021','docker_practice.pdf','测试的pdf文件','.pdf','record',0,'P201806291022080000','DYZL','YB','820032','2018-07-31','820032','2018-07-31 08:43:08','820032',NULL),
(42,'F201807311029595393','2018年7月开发组黄官易日报.pdf','2018年日报','.pdf','record',0,'P201807311016429200','DYZL','ZY','820032','2018-07-31','820032','2018-08-01 10:29:59','820032','2018-07-31 19:32:24'),
(43,'F201807311040087073','2018年7月开发组黄官易日报 (2).pdf','2018年日报7月30日','.pdf','record',0,'P201807311016429200','HYZL','ZY','820032','2018-07-31','820032','2018-07-31 10:40:08','820032',NULL),
(47,'F201807311042238482','2018年7月开发组黄官易日报 (1).pdf','2018年7月31日日报','.pdf','record',0,'P201807311016429200','HYZL','ZY','820001','2018-07-31','820032','2018-07-31 10:42:23','820032',NULL);

/*Table structure for table `kb_file_1` */

DROP TABLE IF EXISTS `kb_file_1`;

CREATE TABLE `kb_file_1` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id自增',
  `file_code` char(19) DEFAULT NULL COMMENT '文件编号 F+yyyyMMddHHmmss+4随机数',
  `file_name` varchar(32) DEFAULT NULL COMMENT '文件名称',
  `file_info` varchar(255) DEFAULT NULL COMMENT '文件信息',
  `file_type` varchar(12) DEFAULT NULL COMMENT '.png/.jpge/.cad/.doc/.docx/.xls…(统一小写)',
  `file_status` varchar(9) DEFAULT NULL COMMENT '删除:delete 在档：record 锁定：locked',
  `file_level` int(2) DEFAULT '1' COMMENT '0为根项目 用于限定开放的项目层级',
  `project_code` char(19) DEFAULT NULL COMMENT '项目格式 P+yyyyMMddHHmmss+4随机数',
  `file_event_type` varchar(10) DEFAULT NULL COMMENT '文件性质(事件)调研资料：DYZL,会议资料：HYZL,公司信息资料：GSXXZL',
  `file_event_level` varchar(10) DEFAULT NULL COMMENT '文件级别(事件)非常重要：FCZY,重要：ZY,一般：YB',
  `file_research_user_code` varchar(11) DEFAULT NULL COMMENT '调研人编码',
  `file_research_start_time` date DEFAULT NULL COMMENT '调研时间',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '员工编号',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_code` varchar(11) DEFAULT NULL COMMENT '更新人编码',
  `update_time` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `index_file_code` (`file_code`) USING BTREE,
  KEY `index_project_code` (`project_code`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

/*Data for the table `kb_file_1` */

insert  into `kb_file_1`(`id`,`file_code`,`file_name`,`file_info`,`file_type`,`file_status`,`file_level`,`project_code`,`file_event_type`,`file_event_level`,`file_research_user_code`,`file_research_start_time`,`create_user_code`,`create_time`,`update_user_code`,`update_time`) values 
(1,'F201806221421466073','新海知识库数据库结构.xlsx','这是一个测试文件','.xlsx','record',1,'P201807141626217964','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:03','820032','2018-07-25 14:43:06'),
(2,'F201806221430024226','七分厂预警通知辅助系统_说明文档.docx','这是一个测试文件','.docx','record',1,'P201806301419440000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:13','820032','2018-07-25 14:43:39'),
(4,'F201806221430021111','新海知识库数据库结构.xlsx','1111','.xlsx','record',1,'P201807141626217964','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:17','820032','2018-07-25 14:43:06'),
(5,'F201806221430021112','新海知识库数据库结构.xlsx','1112','.xlsx','record',1,'P201807141626217964','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:20','820032','2018-07-25 14:43:07'),
(6,'F201806221430021114','新海知识库数据库结构.xlsx','1113','.xlsx','record',1,'P201807141626217964','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:21','820032','2018-07-25 14:43:07'),
(7,'F201806221430021113','新海知识库数据库结构.xlsx','1114','.xlsx','record',1,'P201807141626217964','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:24','820032','2018-07-25 14:43:08'),
(9,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','七分厂预警通知辅助系统_说明文档','.docx','record',1,'P201806301506360000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:10','820032','2018-07-25 14:44:01'),
(10,'F201806301651347463','七分厂预警解决方案.docx','七分厂预警解决方案 详细进度参见https://tower.im/projects/cdd525170aa9478aa9c9180b7f370ce3/todos/0d7fa686a2204a049fd5416052976592/','.docx','record',1,'P201806301647260000','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:42:05','820032','2018-07-25 14:44:10');

/*Table structure for table `kb_file_2` */

DROP TABLE IF EXISTS `kb_file_2`;

CREATE TABLE `kb_file_2` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id自增',
  `file_code` char(19) DEFAULT NULL COMMENT '文件编号 F+yyyyMMddHHmmss+4随机数',
  `file_name` varchar(32) DEFAULT NULL COMMENT '文件名称',
  `file_info` varchar(255) DEFAULT NULL COMMENT '文件信息',
  `file_type` varchar(12) DEFAULT NULL COMMENT '.png/.jpge/.cad/.doc/.docx/.xls…(统一小写)',
  `file_status` varchar(9) DEFAULT NULL COMMENT '删除:delete 在档：record 锁定：locked',
  `file_level` int(2) DEFAULT '2' COMMENT '0为根项目 用于限定开放的项目层级',
  `project_code` char(19) DEFAULT NULL COMMENT '项目格式 P+yyyyMMddHHmmss+4随机数',
  `file_event_type` varchar(10) DEFAULT NULL COMMENT '文件性质(事件)调研资料：DYZL,会议资料：HYZL,公司信息资料：GSXXZL',
  `file_event_level` varchar(10) DEFAULT NULL COMMENT '文件级别(事件)非常重要：FCZY,重要：ZY,一般：YB',
  `file_research_user_code` varchar(11) DEFAULT NULL COMMENT '调研人编码',
  `file_research_start_time` date DEFAULT NULL COMMENT '调研时间',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '员工编号',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_code` varchar(11) DEFAULT NULL COMMENT '更新人编码',
  `update_time` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `index_file_code` (`file_code`) USING BTREE,
  KEY `index_project_code` (`project_code`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `kb_file_2` */

insert  into `kb_file_2`(`id`,`file_code`,`file_name`,`file_info`,`file_type`,`file_status`,`file_level`,`project_code`,`file_event_type`,`file_event_level`,`file_research_user_code`,`file_research_start_time`,`create_user_code`,`create_time`,`update_user_code`,`update_time`) values 
(2,'F201806221430021121','新海知识库数据库结构.xlsx','1121','.xlsx','record',2,'P201807141708466884','DYZL','YB','820032','2018-07-25','820032','2018-07-25 14:37:11','820032','2018-07-25 14:39:00');

/*Table structure for table `kb_file_table` */

DROP TABLE IF EXISTS `kb_file_table`;

CREATE TABLE `kb_file_table` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id自增',
  `ft_code` char(19) DEFAULT NULL COMMENT '文件层级表编码   格式 FT+yyyyMMddHHmmss+3位随机数 关联字段',
  `ft_name` varchar(32) DEFAULT NULL COMMENT '文件层级表名称',
  `file_level` int(2) DEFAULT NULL COMMENT '文件层级',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `un_ft_code` (`ft_code`),
  KEY `un_create_user_code` (`create_user_code`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `kb_file_table` */

insert  into `kb_file_table`(`id`,`ft_code`,`ft_name`,`file_level`,`create_user_code`,`create_time`) values 
(1,'FT20180621160130457','kb_file_0',0,'kb_system','2018-06-21 16:01:30'),
(2,'FT20180621160448460','kb_file_1',1,'kb_system','2018-06-21 16:04:48'),
(3,'FT20180621161533661','kb_file_2',2,'kb_system','2018-06-21 16:15:33');

/*Table structure for table `kb_file_user` */

DROP TABLE IF EXISTS `kb_file_user`;

CREATE TABLE `kb_file_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `file_code` char(19) DEFAULT NULL COMMENT '文件编号 F+yyyyMMddHHmmss+4随机数',
  `file_name` varchar(32) DEFAULT NULL COMMENT '文件名称',
  `file_type` varchar(12) DEFAULT NULL COMMENT '文件类型',
  `file_permission` varchar(8) DEFAULT NULL COMMENT '文件权限 onlyread ：预览（文件预览） download:下载',
  `user_code` varchar(11) DEFAULT NULL COMMENT '用户编码',
  `user_name` varchar(12) DEFAULT NULL COMMENT '用户名称',
  `user_dept_code` char(19) DEFAULT NULL COMMENT '部门编号 格式 D+yyyyMMddHHmmss+4位随机数 关联字段',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `un_file_code_user_code` (`file_code`,`user_code`),
  KEY `un_file_code` (`file_code`),
  KEY `un_user_code` (`user_code`) USING BTREE,
  KEY `un_user_dept_code` (`user_dept_code`) USING BTREE,
  KEY `un_create_user_code` (`create_user_code`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=309 DEFAULT CHARSET=utf8;

/*Data for the table `kb_file_user` */

insert  into `kb_file_user`(`id`,`file_code`,`file_name`,`file_type`,`file_permission`,`user_code`,`user_name`,`user_dept_code`,`create_user_code`,`create_time`) values 
(1,'F201806221421466073','新海知识库数据库结构.xlsx','.xlsx','onlyread','820046','陈专懂','D201806230935390372','820032','2018-06-22 14:21:46'),
(2,'F201806221421466073','新海知识库数据库结构.xlsx','.xlsx','download','820032','黄XX','D201806230935390372','820032','2018-06-22 14:21:46'),
(3,'F201806221421466073','新海知识库数据库结构.xlsx','.xlsx','onlyread','820033','黄XL','D201806230935390372','820032','2018-06-22 14:21:46'),
(4,'F201806221430024226','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820032','黄XX','D201806230935390372','820032','2018-06-22 14:30:02'),
(5,'F201806221430024226','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820046','陈专懂','D201806230935390372','820032','2018-06-22 14:30:02'),
(6,'F201806221430024226','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820033','黄XL','D201806230935390372','820032','2018-06-22 14:30:02'),
(14,'F201806280902157192','4.3 关于MES系统审核会议纪要.docx','.docx','onlyread','820033','C职员','D201806230935390372','820032','2018-06-28 09:02:15'),
(15,'F201806280902157192','4.3 关于MES系统审核会议纪要.docx','.docx','onlyread','820055','D职员','D201806230935390372','820032','2018-06-28 09:02:15'),
(16,'F201806280902157192','4.3 关于MES系统审核会议纪要.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-28 09:02:15'),
(17,'F201806280902157192','4.3 关于MES系统审核会议纪要.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-28 09:02:15'),
(21,'F201806280902157192','4.3 关于MES系统审核会议纪要.docx','.docx','onlyread','820001','X总','D201806230935390370','820032','2018-06-28 09:02:15'),
(22,'F201806280911096486','七分厂预警解决方案.docx','.docx','onlyread','820032','B职员','D201806230935390372','820032','2018-06-28 09:11:09'),
(23,'F201806280911096486','七分厂预警解决方案.docx','.docx','onlyread','820055','D职员','D201806230935390372','820032','2018-06-28 09:11:09'),
(24,'F201806280911096486','七分厂预警解决方案.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-28 09:11:09'),
(25,'F201806280911096486','七分厂预警解决方案.docx','.docx','download','820033','C职员','D201806230935390372','820032','2018-06-28 09:11:09'),
(29,'F201806280911096486','七分厂预警解决方案.docx','.docx','onlyread','820001','X总','D201806230935390370','820032','2018-06-28 09:11:09'),
(30,'F201806280914060626','七分厂MES系统整改会 180530V1.1.docx','.docx','onlyread','820033','C职员','D201806230935390372','820032','2018-06-28 09:14:06'),
(31,'F201806280914060626','七分厂MES系统整改会 180530V1.1.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-28 09:14:06'),
(32,'F201806280914060626','七分厂MES系统整改会 180530V1.1.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-28 09:14:06'),
(33,'F201806280914060626','七分厂MES系统整改会 180530V1.1.docx','.docx','download','820055','D职员','D201806230935390372','820032','2018-06-28 09:14:06'),
(37,'F201806280914060626','七分厂MES系统整改会 180530V1.1.docx','.docx','onlyread','820001','X总','D201806230935390370','820032','2018-06-28 09:14:07'),
(38,'F201806280917563619','警报层级 0508.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-28 09:17:56'),
(39,'F201806280917563619','警报层级 0508.docx','.docx','onlyread','820055','D职员','D201806230935390372','820032','2018-06-28 09:17:56'),
(40,'F201806280917563619','警报层级 0508.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-28 09:17:56'),
(41,'F201806280917563619','警报层级 0508.docx','.docx','download','820033','C职员','D201806230935390372','820032','2018-06-28 09:17:56'),
(45,'F201806280917563619','警报层级 0508.docx','.docx','onlyread','820001','X总','D201806230935390370','820032','2018-06-28 09:17:56'),
(46,'F201806280927034111','新海LOGO_login.png','.png','onlyread','820033','C职员','D201806230935390372','820032','2018-06-28 09:27:03'),
(47,'F201806280927034111','新海LOGO_login.png','.png','onlyread','820055','D职员','D201806230935390372','820032','2018-06-28 09:27:03'),
(48,'F201806280927034111','新海LOGO_login.png','.png','download','820046','A负责人','D201806230935390372','820032','2018-06-28 09:27:03'),
(49,'F201806280927034111','新海LOGO_login.png','.png','download','820032','B职员','D201806230935390372','820032','2018-06-28 09:27:03'),
(53,'F201806280927034111','新海LOGO_login.png','.png','onlyread','820001','X总','D201806230935390370','820032','2018-06-28 09:27:05'),
(54,'F201806281005196561','警报层级 0508.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-28 10:05:19'),
(55,'F201806281005196561','警报层级 0508.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-28 10:05:19'),
(57,'F201806281005196561','警报层级 0508.docx','.docx','onlyread','820001','X总','D201806230935390370','820032','2018-06-28 10:05:19'),
(58,'F201806290838008981','华总App第三版接口文档.docx','.docx','onlyread','820046','A负责人','D201806230935390372','820032','2018-06-29 08:38:00'),
(59,'F201806290838008981','华总App第三版接口文档.docx','.docx','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 08:38:00'),
(60,'F201806290838008981','华总App第三版接口文档.docx','.docx','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 08:38:00'),
(61,'F201806290838008981','华总App第三版接口文档.docx','.docx','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 08:38:00'),
(65,'F201806290838008981','华总App第三版接口文档.docx','.docx','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 08:38:00'),
(66,'F201806290851405944','知识库数据结构demo.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 08:51:40'),
(67,'F201806290851405944','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 08:51:40'),
(68,'F201806290851405944','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 08:51:40'),
(69,'F201806290851405944','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 08:51:40'),
(73,'F201806290851405944','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 08:51:40'),
(74,'F201806290853047271','知识库数据结构demo.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 08:53:04'),
(75,'F201806290853047271','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 08:53:04'),
(77,'F201806290853047271','知识库数据结构demo.xls','.xls','download','820033','C职员','D201806230935390372','820032','2018-06-29 08:53:04'),
(81,'F201806290853047271','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 08:53:04'),
(82,'F201806290853520459','知识库数据结构demo.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 08:53:52'),
(83,'F201806290853520459','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 08:53:52'),
(84,'F201806290853520459','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 08:53:52'),
(85,'F201806290853520459','知识库数据结构demo.xls','.xls','download','820033','C职员','D201806230935390372','820032','2018-06-29 08:53:52'),
(89,'F201806290853520459','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 08:53:52'),
(90,'F201806290904017986','知识库数据结构demo.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 09:04:01'),
(91,'F201806290904017986','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:04:01'),
(92,'F201806290904017986','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:04:01'),
(93,'F201806290904017986','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:04:01'),
(97,'F201806290904017986','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:04:01'),
(98,'F201806290904283293','3月京东销售数据.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 09:04:28'),
(99,'F201806290904283293','3月京东销售数据.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:04:28'),
(100,'F201806290904283293','3月京东销售数据.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:04:28'),
(101,'F201806290904283293','3月京东销售数据.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:04:28'),
(105,'F201806290904283293','3月京东销售数据.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:04:28'),
(106,'F201806290905170545','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:05:17'),
(107,'F201806290905170545','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:05:17'),
(108,'F201806290905170545','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:05:17'),
(109,'F201806290905170545','知识库数据结构demo.xls','.xls','download','820032','B职员','D201806230935390372','820032','2018-06-29 09:05:17'),
(113,'F201806290905170545','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:05:17'),
(114,'F201806290905487228','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:05:48'),
(115,'F201806290905487228','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:05:48'),
(116,'F201806290905487228','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:05:48'),
(117,'F201806290905487228','知识库数据结构demo.xls','.xls','download','820032','B职员','D201806230935390372','820032','2018-06-29 09:05:48'),
(121,'F201806290905487228','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:05:48'),
(122,'F201806290913059274','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:13:05'),
(123,'F201806290913059274','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:13:05'),
(124,'F201806290913059274','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:13:05'),
(125,'F201806290913059274','知识库数据结构demo.xls','.xls','download','820032','B职员','D201806230935390372','820032','2018-06-29 09:13:05'),
(129,'F201806290913059274','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:13:05'),
(130,'F201806290920073415','华总App第三版接口文档.docx','.docx','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 09:20:07'),
(131,'F201806290920073415','华总App第三版接口文档.docx','.docx','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:20:07'),
(132,'F201806290920073415','华总App第三版接口文档.docx','.docx','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:20:07'),
(133,'F201806290920073415','华总App第三版接口文档.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:20:07'),
(137,'F201806290920073415','华总App第三版接口文档.docx','.docx','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:20:07'),
(138,'F201806290921060693','知识库数据结构demo.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 09:21:06'),
(139,'F201806290921060693','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:21:06'),
(140,'F201806290921060693','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:21:06'),
(141,'F201806290921060693','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:21:06'),
(145,'F201806290921060693','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:21:07'),
(146,'F201806290923061350','知识库数据结构demo.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 09:23:06'),
(147,'F201806290923061350','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:23:06'),
(148,'F201806290923061350','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:23:06'),
(149,'F201806290923061350','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:23:06'),
(153,'F201806290923061350','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:23:06'),
(154,'F201806290927322150','知识库数据结构demo.xls','.xls','onlyread','820032','B职员','D201806230935390372','820032','2018-06-29 09:27:32'),
(155,'F201806290927322150','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:27:32'),
(156,'F201806290927322150','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:27:32'),
(157,'F201806290927322150','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:27:32'),
(161,'F201806290927322150','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:27:32'),
(162,'F201806290927586897','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:27:58'),
(163,'F201806290927586897','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:27:58'),
(164,'F201806290927586897','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:27:58'),
(165,'F201806290927586897','知识库数据结构demo.xls','.xls','download','820032','B职员','D201806230935390372','820032','2018-06-29 09:27:58'),
(169,'F201806290927586897','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:27:58'),
(170,'F201806290931024041','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:31:02'),
(171,'F201806290931024041','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:31:02'),
(172,'F201806290931024041','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:31:02'),
(173,'F201806290931024041','知识库数据结构demo.xls','.xls','download','820032','B职员','D201806230935390372','820032','2018-06-29 09:31:02'),
(177,'F201806290931024041','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:31:02'),
(178,'F201806290933225186','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:33:22'),
(179,'F201806290933225186','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:33:22'),
(180,'F201806290933225186','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:33:22'),
(181,'F201806290933225186','知识库数据结构demo.xls','.xls','download','820032','B职员','D201806230935390372','820032','2018-06-29 09:33:22'),
(185,'F201806290933225186','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:33:22'),
(186,'F201806290936263987','知识库数据结构demo.xls','.xls','onlyread','820033','C职员','D201806230935390372','820032','2018-06-29 09:36:26'),
(187,'F201806290936263987','知识库数据结构demo.xls','.xls','onlyread','820055','D职员','D201806230935390372','820032','2018-06-29 09:36:26'),
(188,'F201806290936263987','知识库数据结构demo.xls','.xls','download','820046','A负责人','D201806230935390372','820032','2018-06-29 09:36:26'),
(189,'F201806290936263987','知识库数据结构demo.xls','.xls','download','820032','B职员','D201806230935390372','820032','2018-06-29 09:36:26'),
(193,'F201806290936263987','知识库数据结构demo.xls','.xls','onlyread','820001','X总','D201806230935390370','820032','2018-06-29 09:36:26'),
(196,'F201806221430021112','新海知识库数据库结构.xlsx','.xls','download','820046','B','D201806230935390370','820032','2018-06-29 11:57:44'),
(197,'F201806221430021111','新海知识库数据库结构.xlsx','.xls','download','820047','B职员','D201806230935390370','820032','2018-06-29 11:57:49'),
(198,'F201806221430021113','新海知识库数据库结构.xlsx','.xls','download','820047','B职员','D201806230935390370','820032','2018-06-29 11:57:51'),
(199,'F201806221430021114','新海知识库数据库结构.xlsx','.xls','download','820046','B职员','D201806230935390370','820032','2018-06-29 11:57:53'),
(200,'F201806221430021121','新海知识库数据库结构.xlsx','.xls','download','820047','B职员','D201806230935390370','820032','2018-06-29 11:58:44'),
(201,'F201806300905048406','新海知识库数据库结构.xlsx','.xlsx','onlyread','820033','C职员','D201806230935390372','820046','2018-06-30 09:05:04'),
(202,'F201806300905048406','新海知识库数据库结构.xlsx','.xlsx','onlyread','820055','D职员','D201806230935390372','820046','2018-06-30 09:05:04'),
(203,'F201806300905048406','新海知识库数据库结构.xlsx','.xlsx','onlyread','820047','B职员1','D201806230935390372','820046','2018-06-30 09:05:04'),
(204,'F201806300905048406','新海知识库数据库结构.xlsx','.xlsx','download','820046','A负责人','D201806230935390372','820046','2018-06-30 09:05:04'),
(205,'F201806300905048406','新海知识库数据库结构.xlsx','.xlsx','download','820032','B职员','D201806230935390372','820046','2018-06-30 09:05:04'),
(206,'F201806300905048406','新海知识库数据库结构.xlsx','.xlsx','download','820048','B职员2','D201806230935390372','820046','2018-06-30 09:05:04'),
(208,'F201806300905048406','新海知识库数据库结构.xlsx','.xlsx','onlyread','820001','X总','D201806230935390370','820046','2018-06-30 09:05:04'),
(209,'F201806301010325776','致各位代理们.docx','.docx','download','820046','A负责人','D201806230935390372','820046','2018-06-30 10:10:32'),
(210,'F201806301010325776','致各位代理们.docx','.docx','download','820032','B职员','D201806230935390372','820046','2018-06-30 10:10:32'),
(211,'F201806301010325776','致各位代理们.docx','.docx','download','820033','C职员','D201806230935390372','820046','2018-06-30 10:10:32'),
(212,'F201806301010325776','致各位代理们.docx','.docx','download','820055','D职员','D201806230935390372','820046','2018-06-30 10:10:32'),
(213,'F201806301010325776','致各位代理们.docx','.docx','download','820047','B职员1','D201806230935390372','820046','2018-06-30 10:10:32'),
(214,'F201806301010325776','致各位代理们.docx','.docx','download','820048','B职员2','D201806230935390372','820046','2018-06-30 10:10:32'),
(216,'F201806301010325776','致各位代理们.docx','.docx','onlyread','820001','X总','D201806230935390370','820046','2018-06-30 10:10:32'),
(225,'F201806301035275405','新海知识库数据库结构.xlsx','.xlsx','download','820046','A负责人','D201806230935390372','820046','2018-06-30 10:35:27'),
(226,'F201806301035275405','新海知识库数据库结构.xlsx','.xlsx','download','820032','B职员','D201806230935390372','820046','2018-06-30 10:35:27'),
(227,'F201806301035275405','新海知识库数据库结构.xlsx','.xlsx','download','820033','C职员','D201806230935390372','820046','2018-06-30 10:35:27'),
(228,'F201806301035275405','新海知识库数据库结构.xlsx','.xlsx','download','820055','D职员','D201806230935390372','820046','2018-06-30 10:35:27'),
(229,'F201806301035275405','新海知识库数据库结构.xlsx','.xlsx','download','820047','B职员1','D201806230935390372','820046','2018-06-30 10:35:27'),
(230,'F201806301035275405','新海知识库数据库结构.xlsx','.xlsx','download','820048','B职员2','D201806230935390372','820046','2018-06-30 10:35:27'),
(232,'F201806301035275405','新海知识库数据库结构.xlsx','.xlsx','onlyread','820001','X总','D201806230935390370','820046','2018-06-30 10:35:27'),
(233,'F201806301444208715','警报层级 0508.docx','.docx','onlyread','820055','D职员','D201806230935390372','820032','2018-06-30 14:44:20'),
(234,'F201806301444208715','警报层级 0508.docx','.docx','onlyread','820047','B职员1','D201806230935390372','820032','2018-06-30 14:44:20'),
(235,'F201806301444208715','警报层级 0508.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-30 14:44:20'),
(236,'F201806301444208715','警报层级 0508.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-30 14:44:20'),
(237,'F201806301444208715','警报层级 0508.docx','.docx','download','820033','C职员','D201806230935390372','820032','2018-06-30 14:44:20'),
(238,'F201806301444208715','警报层级 0508.docx','.docx','download','820001','X总','D201806230935390372','kb_system','2018-06-30 14:44:20'),
(239,'F201806301513066890','4.3 关于MES系统审核会议纪要.docx','.docx','onlyread','820055','D职员','D201806230935390372','820032','2018-06-30 15:13:06'),
(240,'F201806301513066890','4.3 关于MES系统审核会议纪要.docx','.docx','onlyread','820047','B职员1','D201806230935390372','820032','2018-06-30 15:13:06'),
(241,'F201806301513066890','4.3 关于MES系统审核会议纪要.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-30 15:13:06'),
(242,'F201806301513066890','4.3 关于MES系统审核会议纪要.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-30 15:13:06'),
(243,'F201806301513066890','4.3 关于MES系统审核会议纪要.docx','.docx','download','820033','C职员','D201806230935390372','820032','2018-06-30 15:13:06'),
(244,'F201806301513066890','4.3 关于MES系统审核会议纪要.docx','.docx','download','820001','X总','D201806230935390372','kb_system','2018-06-30 15:13:06'),
(245,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','.docx','onlyread','820047','B职员1','D201806230935390372','820032','2018-06-30 16:49:31'),
(246,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','.docx','onlyread','820048','B职员2','D201806230935390372','820032','2018-06-30 16:49:31'),
(247,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-30 16:49:31'),
(248,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-30 16:49:31'),
(249,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820033','C职员','D201806230935390372','820032','2018-06-30 16:49:31'),
(250,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820055','D职员','D201806230935390372','820032','2018-06-30 16:49:31'),
(251,'F201806301649318999','七分厂预警通知辅助系统_说明文档.docx','.docx','download','820001','X总','D201806230935390372','kb_system','2018-06-30 16:49:31'),
(252,'F201806301651347463','七分厂预警解决方案.docx','.docx','onlyread','820047','B职员1','D201806230935390372','820032','2018-06-30 16:51:34'),
(253,'F201806301651347463','七分厂预警解决方案.docx','.docx','onlyread','820048','B职员2','D201806230935390372','820032','2018-06-30 16:51:34'),
(254,'F201806301651347463','七分厂预警解决方案.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-06-30 16:51:34'),
(255,'F201806301651347463','七分厂预警解决方案.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-30 16:51:34'),
(256,'F201806301651347463','七分厂预警解决方案.docx','.docx','download','820033','C职员','D201806230935390372','820032','2018-06-30 16:51:34'),
(257,'F201806301651347463','七分厂预警解决方案.docx','.docx','download','820055','D职员','D201806230935390372','820032','2018-06-30 16:51:34'),
(258,'F201806301651347463','七分厂预警解决方案.docx','.docx','download','820001','X总','D201806230935390372','kb_system','2018-06-30 16:51:34'),
(259,'F201806301706392711','测试项目.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-06-30 17:06:39'),
(260,'F201806301706392711','测试项目.docx','.docx','download','820001','X总','D201806230935390372','kb_system','2018-06-30 17:06:39'),
(261,'F201807141155082529','test.pptx','.pptx','onlyread','820046','A负责人','D201806230935390372','820032','2018-07-14 11:55:08'),
(262,'F201807141155082529','test.pptx','.pptx','download','820032','B职员','D201806230935390372','820032','2018-07-14 11:55:08'),
(263,'F201807141155082529','test.pptx','.pptx','download','820001','X总','D201806230935390372','kb_system','2018-07-14 11:55:08'),
(264,'F201807141436114309','华总App第三版接口文档.docx','.docx','download','820046','A负责人','D201806230935390372','820032','2018-07-14 14:36:11'),
(265,'F201807141436114309','华总App第三版接口文档.docx','.docx','download','820032','B职员','D201806230935390372','820032','2018-07-14 14:36:11'),
(266,'F201807141436114309','华总App第三版接口文档.docx','.docx','download','820048','B职员2','D201806230935390372','820032','2018-07-14 14:36:11'),
(267,'F201807141436114309','华总App第三版接口文档.docx','.docx','download','820001','X总','D201806230935390372','kb_system','2018-07-14 14:36:11'),
(268,'F201807141704571992','2018年工作日历.xlsx','.xlsx','onlyread','820055','D职员','D201806230935390372','820100','2018-07-14 17:04:57'),
(269,'F201807141704571992','2018年工作日历.xlsx','.xlsx','download','820046','A负责人','D201806230935390372','820100','2018-07-14 17:04:57'),
(270,'F201807141704571992','2018年工作日历.xlsx','.xlsx','download','820032','B职员','D201806230935390372','820100','2018-07-14 17:04:57'),
(271,'F201807141704571992','2018年工作日历.xlsx','.xlsx','download','820033','C职员','D201806230935390372','820100','2018-07-14 17:04:57'),
(272,'F201807141704571992','2018年工作日历.xlsx','.xlsx','download','820100','测试初始化人员','D201806230935390372','820100','2018-07-14 17:04:57'),
(273,'F201807141704571992','2018年工作日历.xlsx','.xlsx','download','820001','X总','D201806230935390372','kb_system','2018-07-14 17:04:57'),
(274,'F201807191315405132','2018年7月开发组黄官易日报.pdf','.pdf','onlyread','820055','D职员','D201806230935390372','820032','2018-07-19 13:15:40'),
(275,'F201807191315405132','2018年7月开发组黄官易日报.pdf','.pdf','onlyread','820047','B职员1','D201806230935390372','820032','2018-07-19 13:15:40'),
(276,'F201807191315405132','2018年7月开发组黄官易日报.pdf','.pdf','download','820046','A负责人','D201806230935390372','820032','2018-07-19 13:15:40'),
(277,'F201807191315405132','2018年7月开发组黄官易日报.pdf','.pdf','download','820032','B职员','D201806230935390372','820032','2018-07-19 13:15:40'),
(278,'F201807191315405132','2018年7月开发组黄官易日报.pdf','.pdf','download','820033','C职员','D201806230935390372','820032','2018-07-19 13:15:40'),
(279,'F201807191315405132','2018年7月开发组黄官易日报.pdf','.pdf','download','820001','X总','D201806230935390372','kb_system','2018-07-19 13:15:40'),
(280,'F201807211037032228','file_extension_dwg.png','.png','download','820046','A负责人','D201806230935390372','820032','2018-07-21 10:37:03'),
(281,'F201807211037032228','file_extension_dwg.png','.png','download','820032','B职员','D201806230935390372','820032','2018-07-21 10:37:03'),
(282,'F201807211037032228','file_extension_dwg.png','.png','download','820033','C职员','D201806230935390372','820032','2018-07-21 10:37:03'),
(283,'F201807211037032228','file_extension_dwg.png','.png','download','820001','X总','D201806230935390372','kb_system','2018-07-21 10:37:03'),
(284,'F201807310843084021','docker_practice.pdf','.pdf','onlyread','820033','C职员','D201806230935390372','820032','2018-07-31 08:43:08'),
(285,'F201807310843084021','docker_practice.pdf','.pdf','download','820046','A负责人','D201806230935390372','820032','2018-07-31 08:43:08'),
(286,'F201807310843084021','docker_practice.pdf','.pdf','download','820032','B职员','D201806230935390372','820032','2018-07-31 08:43:08'),
(287,'F201807310843084021','docker_practice.pdf','.pdf','download','820001','X总','D201806230935390372','kb_system','2018-07-31 08:43:09'),
(288,'F201807311029595393','2018年7月开发组黄官易日报.pdf','.pdf','onlyread','820046','A负责人','D201806230935390372','820032','2018-07-31 10:29:59'),
(289,'F201807311029595393','2018年7月开发组黄官易日报.pdf','.pdf','download','820001','X总','D201806230935390372','820032','2018-07-31 10:29:59'),
(290,'F201807311029595393','2018年7月开发组黄官易日报.pdf','.pdf','download','820032','B职员','D201806230935390372','820032','2018-07-31 10:29:59'),
(291,'F201807311029595393','2018年7月开发组黄官易日报.pdf','.pdf','download','820100','测试初始化人员','D201806230935390372','820032','2018-07-31 10:29:59'),
(293,'F201807311040087073','2018年7月开发组黄官易日报 (2).pdf','.pdf','onlyread','820046','A负责人','D201806230935390372','820032','2018-07-31 10:40:08'),
(294,'F201807311040087073','2018年7月开发组黄官易日报 (2).pdf','.pdf','download','820032','B职员','D201806230935390372','820032','2018-07-31 10:40:08'),
(295,'F201807311040087073','2018年7月开发组黄官易日报 (2).pdf','.pdf','download','820100','测试初始化人员','D201806230935390372','820032','2018-07-31 10:40:08'),
(296,'F201807311040087073','2018年7月开发组黄官易日报 (2).pdf','.pdf','download','820001','X总','D201806230935390372','kb_system','2018-07-31 10:40:08'),
(306,'F201807311042238482','2018年7月开发组黄官易日报 (1).pdf','.pdf','onlyread','820001','X总','D201806230935390372','820032','2018-07-31 10:42:23'),
(307,'F201807311042238482','2018年7月开发组黄官易日报 (1).pdf','.pdf','download','820032','B职员','D201806230935390372','820032','2018-07-31 10:42:23');

/*Table structure for table `kb_operation_log` */

DROP TABLE IF EXISTS `kb_operation_log`;

CREATE TABLE `kb_operation_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `log_code` varchar(19) DEFAULT NULL COMMENT '日志编码',
  `log_msg` varchar(255) DEFAULT NULL COMMENT '日志内容',
  `log_type` varchar(16) DEFAULT NULL COMMENT '日志类型',
  `log_status` varchar(7) DEFAULT NULL COMMENT '执行结果 success:成功 failed：失败',
  `project_code` char(19) DEFAULT NULL COMMENT '项目编码',
  `log_is_read` char(1) DEFAULT 'N' COMMENT '是否已读',
  `log_user_code` varchar(11) DEFAULT NULL COMMENT '操作人编码',
  `log_user_name` varchar(12) DEFAULT NULL COMMENT '操作人姓名',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建用户编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `un_log_code` (`log_code`) USING BTREE,
  KEY `un_log_user_code` (`log_user_code`) USING BTREE,
  KEY `un_create_user_code` (`create_user_code`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=84 DEFAULT CHARSET=utf8;

/*Data for the table `kb_operation_log` */

insert  into `kb_operation_log`(`id`,`log_code`,`log_msg`,`log_type`,`log_status`,`project_code`,`log_is_read`,`log_user_code`,`log_user_name`,`create_user_code`,`create_time`) values 
(2,'L201807061148160000','B职员,操作了:新增项目表信息及项目员工表信息','type','','P201807061148030000','N','820032','B职员','820032','2018-07-06 11:48:16'),
(3,'L201807061148160000','msg','type','success','projectcode','N','820032','B职员','4321','2018-07-05 09:06:33'),
(4,'L201807061324060000','B职员,操作了:新增项目表信息及项目员工表信息','insert','','P201807061323510000','N','820032','B职员','820032','2018-07-06 13:24:06'),
(5,'L201807061326520000','B职员,操作了:新增项目表信息及项目员工表信息','insert','','P201807061326410000','N','820032','B职员','820032','2018-07-06 13:26:52'),
(6,'L201807061358130000','B职员,操作了:新增项目表信息及项目员工表信息','insert','','P201807061358030000','N','820032','B职员','820032','2018-07-06 13:58:13'),
(7,'L201807061438360000','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807061438270000','N','820032','B职员','820032','2018-07-06 14:38:36'),
(8,'L201807061443014925','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807061442501429','N','820032','B职员','820032','2018-07-06 14:43:01'),
(9,'L201807061539255887','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807061539180986','N','820032','B职员','820032','2018-07-06 15:39:26'),
(10,'L201807061619524537','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807061619456423','N','820032','B职员','820032','2018-07-06 16:19:52'),
(11,'L201807061644154526','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807061644119720','N','820032','B职员','820032','2018-07-06 16:44:15'),
(12,'L201807061655366032','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807061655303352','N','820032','B职员','820032','2018-07-06 16:55:36'),
(13,'L201807070827239631','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807070827157328','N','820032','B职员','820032','2018-07-07 08:27:23'),
(14,'L201807070851374958','B职员,操作了:新增项目表信息及项目员工表信息','insert','success',NULL,'N','820032','B职员','820032','2018-07-07 08:51:37'),
(15,'L201807070857232937','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807070857151822','N','820032','B职员','820032','2018-07-07 08:57:23'),
(16,'L201807071432037057','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807071431027546','N','820032','B职员','820032','2018-07-07 14:32:03'),
(17,'L201807091107441578','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807091107075580','N','820032','B职员','820032','2018-07-09 11:07:44'),
(18,'L201807091301509530','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807091301208273','N','820032','B职员','820032','2018-07-09 13:01:50'),
(19,'L201807091446356275','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807091446163030','N','820032','B职员','820032','2018-07-09 14:46:35'),
(20,'L201807091451340121','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807091451076872','N','820032','B职员','820032','2018-07-09 14:51:34'),
(21,'L201807091553363225','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807091553246659','N','820032','B职员','820032','2018-07-09 15:53:36'),
(22,'L201807091553589893','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807091553246659','N','820032','B职员','820032','2018-07-09 15:53:58'),
(23,'L201807091559149989','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807091558372395','N','820032','B职员','820032','2018-07-09 15:59:14'),
(24,'L201807091600043172','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807091559508354','N','820032','B职员','820032','2018-07-09 16:00:04'),
(25,'L201807091616552178','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807091616356018','N','820032','B职员','820032','2018-07-09 16:16:55'),
(26,'L201807091630066859','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','','N','820032','B职员','820032','2018-07-09 16:30:06'),
(27,'L201807091631190754','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807091631106668','N','820032','B职员','820032','2018-07-09 16:31:19'),
(28,'L201807091655515835','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807091655381473','N','820032','B职员','820032','2018-07-09 16:55:51'),
(29,'L201807091701122397','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807091701029333','N','820032','B职员','820032','2018-07-09 17:01:12'),
(30,'L201807091702010933','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807091701471403','N','820032','B职员','820032','2018-07-09 17:02:01'),
(31,'L201807091703116000','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','','N','820032','B职员','820032','2018-07-09 17:03:12'),
(32,'L201807100814312339','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','','N','820032','B职员','820032','2018-07-10 08:14:31'),
(33,'L201807100819035535','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807100818468722','N','820032','B职员','820032','2018-07-10 08:19:03'),
(34,'L201807100907415053','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807100907103750','N','820032','B职员','820032','2018-07-10 09:07:41'),
(35,'L201807100913503199','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807100913244984','N','820032','B职员','820032','2018-07-10 09:13:50'),
(36,'L201807100914158800','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807100913244984','N','820032','B职员','820032','2018-07-10 09:14:15'),
(37,'L201807100919524394','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807100919413703','N','820032','B职员','820032','2018-07-10 09:19:52'),
(38,'L201807100927532586','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807100927424909','N','820032','B职员','820032','2018-07-10 09:27:54'),
(39,'L201807100940514347','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807100940338673','N','820032','B职员','820032','2018-07-10 09:40:51'),
(40,'L201807101304544139','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807101304296570','N','820032','B职员','820032','2018-07-10 13:04:54'),
(41,'L201807101444409325','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807101444076116','N','820032','B职员','820032','2018-07-10 14:44:40'),
(42,'L201807101445085086','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807101444599669','N','820032','B职员','820032','2018-07-10 14:45:08'),
(43,'L201807101624438129','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807101624216574','N','820032','B职员','820032','2018-07-10 16:24:43'),
(44,'L201807101628124461','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807101627568879','N','820032','B职员','820032','2018-07-10 16:28:12'),
(45,'L201807101632438241','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807101632283979','N','820032','B职员','820032','2018-07-10 16:32:43'),
(46,'L201807101642470020','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807101642235831','N','820032','B职员','820032','2018-07-10 16:42:47'),
(47,'L201807101657021558','B职员,操作了:新增项目表信息及项目员工表信息','insert','false','P201807101656524807','N','820032','B职员','820032','2018-07-10 16:57:02'),
(48,'L201807101700023373','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807101659547195','N','820032','B职员','820032','2018-07-10 17:00:02'),
(51,'L201807111120418923','B职员,操作时出现异常，异常信息为：新建项目失败','insert','error','P201807111120414825','N','820032','B职员','820032','2018-07-11 11:20:41'),
(52,'L201807111126468732','B职员,操作时出现异常，异常信息为：新建项目失败','insert','error','P201807111126468920','N','820032','B职员','820032','2018-07-11 11:26:46'),
(53,'L201807141405182219','B职员,操作了:新增项目表信息及项目员工表信息','insert','success','P201807141405185886','N','820032','B职员','820032','2018-07-14 14:05:18'),
(54,'L201807141613159761','测试初始化人员,创建项目知识库','insert','success','P201807141613152269','N','820100','测试初始化人员','820100','2018-07-14 16:13:15'),
(55,'L201807141615324346','测试初始化人员,创建项目知识库需求整理','insert','success','P201807141615313158','N','820100','测试初始化人员','820100','2018-07-14 16:15:32'),
(56,'L201807141626219755','测试初始化人员,创建项目【知识库开发模块整理】','insert','success','P201807141626217964','N','820100','测试初始化人员','820100','2018-07-14 16:26:21'),
(57,'L201807141704571402','测试初始化人员,新增文件【2018年工作日历.xlsx】','insertFile','success','P201807141613152269','N','820100','测试初始化人员','820100','2018-07-14 17:04:57'),
(58,'L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','insertProject','success','P201807141708466884','N','820100','测试初始化人员','820100','2018-07-14 17:08:46'),
(59,'L201807161112286041','B职员,创建项目【第三层边界确认】','insertProject','success','P201807161112283059','N','820032','B职员','820032','2018-07-16 11:12:28'),
(60,'L201807191315402916','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','insertFile','success','P201806291022080000','N','820032','B职员','820032','2018-07-19 13:15:40'),
(61,'L201807211037036118','B职员,新增文件【file_extension_dwg.png】','insertFile','success','P201806291022080000','N','820032','B职员','820032','2018-07-21 10:37:03'),
(62,'L201807271225206708','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807271225200907','N','820032','B职员','820032','2018-07-27 12:25:20'),
(63,'L201807301341138708','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807301341131182','N','820032','B职员','820032','2018-07-30 13:41:13'),
(64,'L201807310835094703','B职员,操作时出现异常，异常信息为：文件上传服务异常,请联系系统管理员','insertFile','error','P201806291022080000','N','820032','B职员','820032','2018-07-31 08:35:09'),
(65,'L201807310841521883','B职员,操作时出现异常，异常信息为：文件上传服务异常,请联系系统管理员','insertFile','error','P201806291022080000','N','820032','B职员','820032','2018-07-31 08:41:52'),
(66,'L201807310843095579','B职员,新增文件【docker_practice.pdf】','insertFile','success','P201806291022080000','N','820032','B职员','820032','2018-07-31 08:43:09'),
(67,'L201807310948081053','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807310948084943','N','820032','B职员','820032','2018-07-31 09:48:08'),
(68,'L201807310951151704','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807310951142459','N','820032','B职员','820032','2018-07-31 09:51:15'),
(69,'L201807310955312917','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807310955311584','N','820032','B职员','820032','2018-07-31 09:55:31'),
(70,'L201807310957277481','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807310957259879','N','820032','B职员','820032','2018-07-31 09:57:27'),
(71,'L201807310958364777','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807310958361521','N','820032','B职员','820032','2018-07-31 09:58:36'),
(72,'L201807311003424610','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807311002571814','N','820032','B职员','820032','2018-07-31 10:03:43'),
(73,'L201807311004109891','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807311003464436','N','820032','B职员','820032','2018-07-31 10:04:10'),
(74,'L201807311006452210','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807311006455329','N','820032','B职员','820032','2018-07-31 10:06:45'),
(75,'L201807311009299176','B职员,操作时出现异常，异常信息为：新增项目异常,请联系系统管理员','insertProject','error','P201807311009291544','N','820032','B职员','820032','2018-07-31 10:09:29'),
(76,'L201807311014307301','B职员,操作时出现异常，异常信息为：新建项目失败','insertProject','error','P201807311014291930','N','820032','B职员','820032','2018-07-31 10:14:30'),
(77,'L201807311016436019','B职员,创建项目【多人协作项目】','insertProject','success','P201807311016429200','N','820032','B职员','820032','2018-07-31 10:16:43'),
(78,'L201807311029593755','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','insertFile','success','P201807311016429200','N','820032','B职员','820032','2018-07-31 10:29:59'),
(79,'L201807311040084576','B职员,新增文件【2018年7月开发组黄官易日报 (2).pdf】','insertFile','success','P201807311016429200','N','820032','B职员','820032','2018-07-31 10:40:08'),
(80,'L201807311040372963','B职员,操作时出现异常，异常信息为：文件保存失败','insertFile','error','P201807311016429200','N','820032','B职员','820032','2018-07-31 10:40:37'),
(81,'L201807311040583023','B职员,操作时出现异常，异常信息为：文件保存失败','insertFile','error','P201807311016429200','N','820032','B职员','820032','2018-07-31 10:40:58'),
(82,'L201807311041281623','B职员,操作时出现异常，异常信息为：文件保存失败','insertFile','error','P201807311016429200','N','820032','B职员','820032','2018-07-31 10:41:28'),
(83,'L201807311042245426','B职员,新增文件【2018年7月开发组黄官易日报 (1).pdf】','insertFile','success','P201807311016429200','N','820032','B职员','820032','2018-07-31 10:42:24');

/*Table structure for table `kb_professional` */

DROP TABLE IF EXISTS `kb_professional`;

CREATE TABLE `kb_professional` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `professional_code` char(19) DEFAULT NULL COMMENT '职称编码    PR+yyyyMMddHHmmss+2随机数',
  `professional_name` varchar(32) DEFAULT NULL COMMENT '职称名称',
  `professional_level` int(2) DEFAULT NULL COMMENT '职称等级',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建用户编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `un_professional_code` (`professional_code`) USING BTREE,
  KEY `un_create_user_code` (`create_user_code`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `kb_professional` */

insert  into `kb_professional`(`id`,`professional_code`,`professional_name`,`professional_level`,`create_user_code`,`create_time`) values 
(1,'PR20180623101010123','负责人',1,'820032','2018-06-23 10:01:36'),
(2,'PR20180623101010124','职员',2,'820033','2018-06-23 10:02:41');

/*Table structure for table `kb_project_0` */

DROP TABLE IF EXISTS `kb_project_0`;

CREATE TABLE `kb_project_0` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id主键自增',
  `project_code` char(19) DEFAULT NULL COMMENT '项目格式 P+yyyyMMddHHmmss+4随机数',
  `project_name` varchar(32) DEFAULT NULL COMMENT '项目名称',
  `project_type` char(3) DEFAULT NULL COMMENT '项目类型    pub:职务任务（公有）/own：个人任务（私有）||此字段现版本不启用',
  `project_info` varchar(255) DEFAULT NULL COMMENT '项目创建目的',
  `project_remark` varchar(255) DEFAULT NULL COMMENT '项目备注',
  `project_parent_code` char(19) DEFAULT NULL COMMENT '项目所属父项目编码',
  `project_level` int(2) DEFAULT '0' COMMENT '项目级别  0为根项目 用于限定开放的项目层级',
  `project_status` varchar(9) DEFAULT NULL COMMENT '项目类型  progress:进行中 completed：已完成 canceled：已取消 locked：已锁定',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_code` varchar(11) DEFAULT NULL COMMENT '更新人编码',
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `un_project_code` (`project_code`),
  KEY `un_project_parent_code` (`project_parent_code`),
  KEY `un_create_user_code` (`create_user_code`),
  KEY `un_update_user_code` (`update_user_code`)
) ENGINE=InnoDB AUTO_INCREMENT=92 DEFAULT CHARSET=utf8;

/*Data for the table `kb_project_0` */

insert  into `kb_project_0`(`id`,`project_code`,`project_name`,`project_type`,`project_info`,`project_remark`,`project_parent_code`,`project_level`,`project_status`,`create_user_code`,`create_time`,`update_user_code`,`update_time`) values 
(1,'P201806291022080000','七分厂数据车间改造','pub','七分厂数据车间改造的可行性调研报告','','',0,'progress','820032','2018-06-29 10:22:08','820032','2018-07-25 15:22:46'),
(3,'P201806301656390000','计划1','pub','....','','',0,'progress','820032','2018-06-30 16:56:39','820032','2018-07-04 09:23:48'),
(80,'P201807141613152269','知识库','pub','知识库的简单描述','','',0,'progress','820100','2018-07-14 16:13:15','820100','2018-07-14 16:13:14'),
(91,'P201807311016429200','多人协作项目','pub','多人协作项目','','',0,'progress','820032','2018-07-31 10:16:42','820032','2018-07-31 10:16:45');

/*Table structure for table `kb_project_1` */

DROP TABLE IF EXISTS `kb_project_1`;

CREATE TABLE `kb_project_1` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id主键自增',
  `project_code` char(19) DEFAULT NULL COMMENT '项目格式 P+yyyyMMddHHmmss+4随机数',
  `project_name` varchar(32) DEFAULT NULL COMMENT '项目名称',
  `project_type` char(3) DEFAULT NULL COMMENT '项目类型    pub:职务任务（公有）/own：个人任务（私有）||此字段现版本不启用',
  `project_info` varchar(255) DEFAULT NULL COMMENT '项目创建目的',
  `project_remark` varchar(255) DEFAULT NULL COMMENT '项目备注',
  `project_parent_code` char(19) DEFAULT NULL COMMENT '项目所属父项目编码',
  `project_level` int(2) DEFAULT '1' COMMENT '项目级别  0为根项目 用于限定开放的项目层级',
  `project_status` varchar(9) DEFAULT NULL COMMENT '项目类型  progress:进行中 completed：已完成 canceled：已取消',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_code` varchar(11) DEFAULT NULL COMMENT '更新人编码',
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `un_project_code` (`project_code`),
  KEY `un_project_parent_code` (`project_parent_code`),
  KEY `un_create_user_code` (`create_user_code`),
  KEY `un_update_user_code` (`update_user_code`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8;

/*Data for the table `kb_project_1` */

insert  into `kb_project_1`(`id`,`project_code`,`project_name`,`project_type`,`project_info`,`project_remark`,`project_parent_code`,`project_level`,`project_status`,`create_user_code`,`create_time`,`update_user_code`,`update_time`) values 
(13,'P201806301419440000','七分厂数字化改造可行性会议','pub','对七分厂数字化改造的可行性分析会议','','P201806291022080000',1,'completed','820032','2018-06-30 14:19:44','820032','2018-07-13 13:43:44'),
(14,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','pub','关于七分厂数字化改造可行性报告及开发进度','','P201806291022080000',1,'completed','820032','2018-06-30 15:06:36','820032','2018-07-10 14:49:24'),
(15,'P201806301647260000','七分厂数据车间改造反馈结果','pub','七分厂数据车间改造反馈结果','','P201806291022080000',1,'completed','820032','2018-06-30 16:47:26','820032','2018-07-10 14:48:33'),
(16,'P201806301656590000','计划2','pub','..','','P201806301656390000',1,'completed','820032','2018-06-30 16:56:59','820032','2018-07-23 14:50:22'),
(29,'P201807071506474996','创建新项目测试','pub','创建新项目测试的描述信息','','P201806301656390000',1,'completed','820032','2018-07-07 15:06:47','820032','2018-07-23 15:29:04'),
(30,'P201807071509196731','创建新项目demo','pub','创建新项目demo描述','','P201806301656390000',1,'canceled','820032','2018-07-07 15:09:19','820032','2018-07-23 13:33:26'),
(31,'P201807071632087030','创建新项目','pub','创建新项目简单描述','','P201806301656390000',1,'canceled','820032','2018-07-07 16:32:08','820032','2018-07-23 13:32:44'),
(50,'P201807141615313158','知识库需求整理','pub','知识库需求整理的简单描述','','P201807141613152269',1,'completed','820100','2018-07-14 16:15:31','820032','2018-07-23 15:06:29'),
(51,'P201807141626217964','知识库开发模块整理','pub','知识库开发模块整理的基础描述','','P201807141613152269',1,'completed','820100','2018-07-14 16:26:21','820032','2018-07-23 16:32:25');

/*Table structure for table `kb_project_2` */

DROP TABLE IF EXISTS `kb_project_2`;

CREATE TABLE `kb_project_2` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id主键自增',
  `project_code` char(19) DEFAULT NULL COMMENT '项目格式 P+yyyyMMddHHmmss+4随机数',
  `project_name` varchar(32) DEFAULT NULL COMMENT '项目名称',
  `project_type` char(3) DEFAULT NULL COMMENT '项目类型    pub:职务任务（公有）/own：个人任务（私有）||此字段现版本不启用',
  `project_info` varchar(255) DEFAULT NULL COMMENT '项目创建目的',
  `project_remark` varchar(255) DEFAULT NULL COMMENT '项目备注',
  `project_parent_code` char(19) DEFAULT NULL COMMENT '项目所属父项目编码',
  `project_level` int(2) DEFAULT '2' COMMENT '项目级别  0为根项目 用于限定开放的项目层级',
  `project_status` varchar(9) DEFAULT NULL COMMENT '项目类型  progress:进行中 completed：已完成 canceled：已取消',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_code` varchar(11) DEFAULT NULL COMMENT '更新人编码',
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `un_project_code` (`project_code`),
  KEY `un_project_parent_code` (`project_parent_code`),
  KEY `un_create_user_code` (`create_user_code`),
  KEY `un_update_user_code` (`update_user_code`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

/*Data for the table `kb_project_2` */

insert  into `kb_project_2`(`id`,`project_code`,`project_name`,`project_type`,`project_info`,`project_remark`,`project_parent_code`,`project_level`,`project_status`,`create_user_code`,`create_time`,`update_user_code`,`update_time`) values 
(12,'P201807141708466884','知识库通知模块','pub','知识库通知模块的基础信息','','P201807141615313158',2,'progress','820100','2018-07-14 17:08:46','820100','2018-07-14 17:08:45'),
(13,'P201807161112283059','第三层边界确认','pub','第三层边界确认的简单描述','','P201806301419440000',2,'progress','820032','2018-07-16 11:12:28','820032','2018-08-01 11:14:01');

/*Table structure for table `kb_project_table` */

DROP TABLE IF EXISTS `kb_project_table`;

CREATE TABLE `kb_project_table` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id主键自增',
  `pt_code` varchar(19) DEFAULT NULL COMMENT '项目层级编码 格式 PT+yyyyMMddHHmmss+3位随机数 关联字段',
  `pt_name` varchar(32) DEFAULT NULL COMMENT '项目层级名称',
  `project_level` int(2) DEFAULT NULL COMMENT '项目级别',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `un_pt_code` (`pt_code`),
  KEY `un_create_user_code` (`create_user_code`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `kb_project_table` */

insert  into `kb_project_table`(`id`,`pt_code`,`pt_name`,`project_level`,`create_user_code`,`create_time`) values 
(1,'PT20180622094237615','kb_project_0',0,'kb_system','2018-06-22 09:42:37'),
(2,'PT20180622131807502','kb_project_1',1,'kb_system','2018-06-22 13:18:07'),
(3,'PT20180622131758614','kb_project_2',2,'kb_system','2018-06-22 13:17:58');

/*Table structure for table `kb_project_user` */

DROP TABLE IF EXISTS `kb_project_user`;

CREATE TABLE `kb_project_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `project_code` char(19) DEFAULT NULL COMMENT '项目编码  格式 P+yyyyMMddHHmmss+4随机数',
  `project_name` varchar(32) DEFAULT NULL COMMENT '项目名称',
  `project_permission` char(5) DEFAULT NULL COMMENT '所属项目权限   write：可编辑 read ：只读',
  `project_level` int(2) DEFAULT NULL COMMENT '项目等级',
  `user_code` varchar(11) DEFAULT NULL COMMENT '用户编码',
  `user_name` varchar(12) DEFAULT NULL COMMENT '用户名称',
  `user_dept_code` char(19) DEFAULT NULL COMMENT '部门编号 格式 D+yyyyMMddHHmmss+4位随机数 关联字段',
  `project_main_code` char(19) DEFAULT NULL COMMENT '项目编码  格式 P+yyyyMMddHHmmss+4随机数',
  `project_main_name` varchar(32) DEFAULT NULL COMMENT '项目名称',
  `project_is_collect` char(1) DEFAULT 'N',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建人编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `un_project_code_user_code` (`project_code`,`user_code`),
  KEY `un_project_code` (`project_code`) USING BTREE,
  KEY `un_user_code` (`user_code`) USING BTREE,
  KEY `un_user_dept_code` (`user_dept_code`) USING BTREE,
  KEY `un_create_user_code` (`create_user_code`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=297 DEFAULT CHARSET=utf8;

/*Data for the table `kb_project_user` */

insert  into `kb_project_user`(`id`,`project_code`,`project_name`,`project_permission`,`project_level`,`user_code`,`user_name`,`user_dept_code`,`project_main_code`,`project_main_name`,`project_is_collect`,`create_user_code`,`create_time`) values 
(20,'P201806291022080000','七分厂数据车间改造','write',0,'820046','A负责人','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-29 10:22:08'),
(21,'P201806291022080000','七分厂数据车间改造','write',0,'820032','B职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','820032','2018-06-29 10:22:08'),
(22,'P201806291022080000','七分厂数据车间改造','read',0,'820033','C职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-29 10:22:08'),
(23,'P201806291022080000','七分厂数据车间改造','read',0,'820001','X总','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','kb_system','2018-06-29 10:22:08'),
(30,'P201806301419440000','七分厂数字化改造可行性会议','write',1,'820046','A负责人','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 14:19:44'),
(31,'P201806301419440000','七分厂数字化改造可行性会议','write',1,'820032','B职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','820032','2018-06-30 14:19:44'),
(32,'P201806301419440000','七分厂数字化改造可行性会议','write',1,'820033','C职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 14:19:44'),
(33,'P201806301419440000','七分厂数字化改造可行性会议','write',1,'820055','D职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 14:19:44'),
(34,'P201806301419440000','七分厂数字化改造可行性会议','read',1,'820047','B职员1','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 14:19:44'),
(35,'P201806301419440000','七分厂数字化改造可行性会议','read',1,'820048','B职员2','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 14:19:44'),
(36,'P201806301419440000','七分厂数字化改造可行性会议','read',1,'820001','X总','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','kb_system','2018-06-30 14:19:44'),
(37,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','write',1,'820046','A负责人','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 15:06:36'),
(38,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','write',1,'820032','B职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','820032','2018-06-30 15:06:36'),
(39,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','write',1,'820033','C职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 15:06:36'),
(40,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','write',1,'820055','D职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 15:06:36'),
(41,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','read',1,'820047','B职员1','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 15:06:36'),
(42,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','read',1,'820048','B职员2','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 15:06:36'),
(43,'P201806301506360000','七分厂数字化改造可行性报告及开发进度','read',1,'820001','X总','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','kb_system','2018-06-30 15:06:36'),
(44,'P201806301647260000','七分厂数据车间改造反馈结果','write',1,'820046','A负责人','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 16:47:26'),
(45,'P201806301647260000','七分厂数据车间改造反馈结果','write',1,'820032','B职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','820032','2018-06-30 16:47:26'),
(46,'P201806301647260000','七分厂数据车间改造反馈结果','write',1,'820033','C职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 16:47:26'),
(47,'P201806301647260000','七分厂数据车间改造反馈结果','read',1,'820055','D职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 16:47:26'),
(48,'P201806301647260000','七分厂数据车间改造反馈结果','read',1,'820047','B职员1','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 16:47:26'),
(49,'P201806301647260000','七分厂数据车间改造反馈结果','read',1,'820048','B职员2','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','820032','2018-06-30 16:47:26'),
(50,'P201806301647260000','七分厂数据车间改造反馈结果','read',1,'820001','X总','D201806230935390372','P201806291022080000','七分厂数据车间改造','N','kb_system','2018-06-30 16:47:26'),
(51,'P201806301656390000','计划1','write',0,'820032','B职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-06-30 16:56:39'),
(52,'P201806301656390000','计划1','read',0,'820046','A负责人','D201806230935390372','P201806301656390000','计划1','N','820032','2018-06-30 16:56:39'),
(53,'P201806301656390000','计划1','read',0,'820001','X总','D201806230935390372','P201806301656390000','计划1','N','kb_system','2018-06-30 16:56:39'),
(54,'P201806301656590000','计划2','write',1,'820032','B职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-06-30 16:56:59'),
(55,'P201806301656590000','计划2','read',1,'820001','X总','D201806230935390372','P201806301656390000','计划1','N','kb_system','2018-06-30 16:56:59'),
(105,'P201807071506474996','创建新项目测试','write',1,'820046','A负责人','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:06:47'),
(106,'P201807071506474996','创建新项目测试','write',1,'820032','B职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:06:47'),
(107,'P201807071506474996','创建新项目测试','write',1,'820033','C职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:06:47'),
(108,'P201807071506474996','创建新项目测试','read',1,'820055','D职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:06:47'),
(109,'P201807071506474996','创建新项目测试','read',1,'820047','B职员1','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:06:47'),
(110,'P201807071506474996','创建新项目测试','read',1,'820001','X总','D201806230935390372','P201806301656390000','计划1','N','kb_system','2018-07-07 15:06:49'),
(111,'P201807071509196731','创建新项目demo','write',1,'820046','A负责人','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:09:19'),
(112,'P201807071509196731','创建新项目demo','write',1,'820032','B职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:09:19'),
(113,'P201807071509196731','创建新项目demo','write',1,'820055','D职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:09:19'),
(114,'P201807071509196731','创建新项目demo','read',1,'820033','C职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:09:19'),
(115,'P201807071509196731','创建新项目demo','read',1,'820047','B职员1','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 15:09:19'),
(116,'P201807071509196731','创建新项目demo','read',1,'820001','X总','D201806230935390372','P201806301656390000','计划1','N','kb_system','2018-07-07 15:09:19'),
(117,'P201807071632087030','创建新项目','write',1,'820046','A负责人','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 16:32:08'),
(118,'P201807071632087030','创建新项目','write',1,'820032','B职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 16:32:08'),
(119,'P201807071632087030','创建新项目','read',1,'820033','C职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 16:32:08'),
(120,'P201807071632087030','创建新项目','read',1,'820055','D职员','D201806230935390372','P201806301656390000','计划1','N','820032','2018-07-07 16:32:08'),
(121,'P201807071632087030','创建新项目','read',1,'820001','X总','D201806230935390372','P201806301656390000','计划1','N','kb_system','2018-07-07 16:32:08'),
(190,'P201807100913244984','AOPRequest调试','write',0,'820046','A负责人','D201806230935390372','P201807100913244984','AOPRequest调试','N','820032','2018-07-10 09:13:50'),
(191,'P201807100913244984','AOPRequest调试','write',0,'820032','B职员','D201806230935390372','P201807100913244984','AOPRequest调试','N','820032','2018-07-10 09:13:50'),
(192,'P201807100913244984','AOPRequest调试','write',0,'820048','B职员2','D201806230935390372','P201807100913244984','AOPRequest调试','N','820032','2018-07-10 09:13:50'),
(193,'P201807100913244984','AOPRequest调试','read',0,'820001','X总','D201806230935390372','P201807100913244984','AOPRequest调试','N','kb_system','2018-07-10 09:13:50'),
(198,'P201807100919413703','Test','write',0,'820046','A负责人','D201806230935390372','P201807100919413703','Test','N','820032','2018-07-10 09:19:52'),
(199,'P201807100919413703','Test','write',0,'820032','B职员','D201806230935390372','P201807100919413703','Test','N','820032','2018-07-10 09:19:52'),
(200,'P201807100919413703','Test','write',0,'820048','B职员2','D201806230935390372','P201807100919413703','Test','N','820032','2018-07-10 09:19:52'),
(201,'P201807100919413703','Test','read',0,'820001','X总','D201806230935390372','P201807100919413703','Test','N','kb_system','2018-07-10 09:19:52'),
(202,'P201807100941505736','创建新项目','write',0,'820032','B职员','D201806230935390372','P201807100941505736','创建新项目','N','820032','2018-07-10 09:42:13'),
(203,'P201807100941505736','创建新项目','read',0,'820001','X总','D201806230935390372','P201807100941505736','创建新项目','N','kb_system','2018-07-10 09:42:13'),
(204,'P201807101304296570','AOP测试继续阿弥陀佛','write',0,'820046','A负责人','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 13:04:54'),
(205,'P201807101304296570','AOP测试继续阿弥陀佛','write',0,'820032','B职员','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 13:04:54'),
(206,'P201807101304296570','AOP测试继续阿弥陀佛','write',0,'820048','B职员2','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 13:04:54'),
(207,'P201807101304296570','AOP测试继续阿弥陀佛','read',0,'820001','X总','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','kb_system','2018-07-10 13:04:54'),
(208,'P201807101444076116','通知设置成功没有','write',0,'820046','A负责人','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 14:44:40'),
(209,'P201807101444076116','通知设置成功没有','write',0,'820032','B职员','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 14:44:40'),
(210,'P201807101444076116','通知设置成功没有','write',0,'820048','B职员2','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 14:44:40'),
(211,'P201807101444076116','通知设置成功没有','read',0,'820001','X总','D201806230935390372','P201807101444076116','通知设置成功没有','N','kb_system','2018-07-10 14:44:40'),
(212,'P201807101444599669','test111','write',1,'820046','A负责人','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 14:45:08'),
(213,'P201807101444599669','test111','write',1,'820032','B职员','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 14:45:08'),
(214,'P201807101444599669','test111','write',1,'820048','B职员2','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 14:45:08'),
(215,'P201807101444599669','test111','read',1,'820001','X总','D201806230935390372','P201807101444076116','通知设置成功没有','N','kb_system','2018-07-10 14:45:08'),
(216,'P201807101624216574','test222','write',1,'820046','A负责人','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:24:43'),
(217,'P201807101624216574','test222','write',1,'820032','B职员','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:24:43'),
(218,'P201807101624216574','test222','write',1,'820033','C职员','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:24:43'),
(219,'P201807101624216574','test222','write',1,'820048','B职员2','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:24:43'),
(220,'P201807101624216574','test222','read',1,'820001','X总','D201806230935390372','P201807101444076116','通知设置成功没有','N','kb_system','2018-07-10 16:24:43'),
(221,'P201807101627568879','TEST333','write',1,'820046','A负责人','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:28:12'),
(222,'P201807101627568879','TEST333','write',1,'820032','B职员','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:28:12'),
(223,'P201807101627568879','TEST333','write',1,'820048','B职员2','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:28:12'),
(224,'P201807101627568879','TEST333','read',1,'820001','X总','D201806230935390372','P201807101444076116','通知设置成功没有','N','kb_system','2018-07-10 16:28:12'),
(225,'P201807101632283979','test333','write',1,'820046','A负责人','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:32:43'),
(226,'P201807101632283979','test333','write',1,'820032','B职员','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:32:43'),
(227,'P201807101632283979','test333','write',1,'820048','B职员2','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-10 16:32:43'),
(228,'P201807101632283979','test333','read',1,'820001','X总','D201806230935390372','P201807101444076116','通知设置成功没有','N','kb_system','2018-07-10 16:32:43'),
(229,'P201807101642235831','测试@After','write',1,'820046','A负责人','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 16:42:47'),
(230,'P201807101642235831','测试@After','write',1,'820032','B职员','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 16:42:47'),
(231,'P201807101642235831','测试@After','write',1,'820048','B职员2','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 16:42:47'),
(232,'P201807101642235831','测试@After','read',1,'820001','X总','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','kb_system','2018-07-10 16:42:47'),
(233,'P201807101656524807','天天天天天','write',1,'820046','A负责人','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 16:57:02'),
(234,'P201807101656524807','天天天天天','write',1,'820032','B职员','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 16:57:02'),
(235,'P201807101656524807','天天天天天','read',1,'820001','X总','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','kb_system','2018-07-10 16:57:02'),
(236,'P201807101659547195','大大大大大大','write',1,'820046','A负责人','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 17:00:02'),
(237,'P201807101659547195','大大大大大大','write',1,'820032','B职员','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 17:00:02'),
(238,'P201807101659547195','大大大大大大','write',1,'820048','B职员2','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','820032','2018-07-10 17:00:02'),
(239,'P201807101659547195','大大大大大大','read',1,'820001','X总','D201806230935390372','P201807101304296570','AOP测试继续阿弥陀佛','N','kb_system','2018-07-10 17:00:02'),
(252,'P201807141405185886','test222','write',1,'820046','A负责人','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-14 14:05:18'),
(253,'P201807141405185886','test222','write',1,'820032','B职员','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-14 14:05:18'),
(254,'P201807141405185886','test222','write',1,'820048','B职员2','D201806230935390372','P201807101444076116','通知设置成功没有','N','820032','2018-07-14 14:05:18'),
(255,'P201807141405185886','test222','read',1,'820001','X总','D201806230935390372','P201807101444076116','通知设置成功没有','N','kb_system','2018-07-14 14:05:18'),
(256,'P201807141613152269','知识库','write',0,'820046','A负责人','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:13:15'),
(257,'P201807141613152269','知识库','write',0,'820032','B职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:13:15'),
(258,'P201807141613152269','知识库','write',0,'820033','C职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:13:15'),
(259,'P201807141613152269','知识库','write',0,'820100','测试初始化人员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:13:15'),
(260,'P201807141613152269','知识库','read',0,'820055','D职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:13:15'),
(261,'P201807141613152269','知识库','read',0,'820001','X总','D201806230935390372','P201807141613152269','知识库','N','kb_system','2018-07-14 16:13:15'),
(262,'P201807141615313158','知识库需求整理','write',1,'820046','A负责人','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:15:31'),
(263,'P201807141615313158','知识库需求整理','write',1,'820032','B职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:15:31'),
(264,'P201807141615313158','知识库需求整理','write',1,'820033','C职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:15:31'),
(265,'P201807141615313158','知识库需求整理','write',1,'820055','D职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:15:31'),
(266,'P201807141615313158','知识库需求整理','write',1,'820100','测试初始化人员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:15:31'),
(267,'P201807141615313158','知识库需求整理','read',1,'820047','B职员1','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:15:31'),
(268,'P201807141615313158','知识库需求整理','read',1,'820001','X总','D201806230935390372','P201807141613152269','知识库','N','kb_system','2018-07-14 16:15:31'),
(269,'P201807141626217964','知识库开发模块整理','write',1,'820046','A负责人','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:26:21'),
(270,'P201807141626217964','知识库开发模块整理','write',1,'820032','B职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:26:21'),
(271,'P201807141626217964','知识库开发模块整理','write',1,'820033','C职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:26:21'),
(272,'P201807141626217964','知识库开发模块整理','write',1,'820055','D职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:26:21'),
(273,'P201807141626217964','知识库开发模块整理','write',1,'820100','测试初始化人员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:26:21'),
(274,'P201807141626217964','知识库开发模块整理','read',1,'820047','B职员1','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 16:26:21'),
(275,'P201807141626217964','知识库开发模块整理','read',1,'820001','X总','D201806230935390372','P201807141613152269','知识库','N','kb_system','2018-07-14 16:26:21'),
(276,'P201807141708466884','知识库通知模块','write',2,'820046','A负责人','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 17:08:46'),
(277,'P201807141708466884','知识库通知模块','write',2,'820032','B职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 17:08:46'),
(278,'P201807141708466884','知识库通知模块','write',2,'820033','C职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 17:08:46'),
(279,'P201807141708466884','知识库通知模块','write',2,'820055','D职员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 17:08:46'),
(280,'P201807141708466884','知识库通知模块','write',2,'820100','测试初始化人员','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 17:08:46'),
(281,'P201807141708466884','知识库通知模块','read',2,'820047','B职员1','D201806230935390372','P201807141613152269','知识库','N','820100','2018-07-14 17:08:46'),
(282,'P201807141708466884','知识库通知模块','read',2,'820001','X总','D201806230935390372','P201807141613152269','知识库','N','kb_system','2018-07-14 17:08:46'),
(283,'P201807161112283059','第三层边界确认','write',2,'820046','A负责人','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','820032','2018-07-16 11:12:28'),
(284,'P201807161112283059','第三层边界确认','write',2,'820032','B职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','820032','2018-07-16 11:12:28'),
(285,'P201807161112283059','第三层边界确认','read',2,'820033','C职员','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','820032','2018-07-16 11:12:28'),
(286,'P201807161112283059','第三层边界确认','read',2,'820001','X总','D201806230935390372','P201806291022080000','七分厂数据车间改造','Y','kb_system','2018-07-16 11:12:28'),
(292,'P201807311016429200','多人协作项目','write',0,'820001','X总','PR20180623101010123','P201807311016429200','多人协作项目','N','820032','2018-07-31 10:16:42'),
(293,'P201807311016429200','多人协作项目','write',0,'820046','A负责人','PR20180623101010123','P201807311016429200','多人协作项目','N','820032','2018-07-31 10:16:42'),
(294,'P201807311016429200','多人协作项目','write',0,'820032','B职员','PR20180623101010124','P201807311016429200','多人协作项目','Y','820032','2018-07-31 10:16:42'),
(295,'P201807311016429200','多人协作项目','read',0,'820100','测试初始化人员','PR20180623101010124','P201807311016429200','多人协作项目','N','820032','2018-07-31 10:16:42');

/*Table structure for table `kb_server` */

DROP TABLE IF EXISTS `kb_server`;

CREATE TABLE `kb_server` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `server_code` varchar(30) DEFAULT NULL COMMENT '服务器编码',
  `server_name` varchar(30) DEFAULT NULL COMMENT '服务器主机名',
  `server_core` int(2) DEFAULT NULL COMMENT '服务器核心',
  `server_memory` int(3) DEFAULT NULL COMMENT '服务器带宽',
  `server_band_width` int(3) DEFAULT NULL COMMENT '服务器带宽',
  `in_ip` char(15) DEFAULT NULL COMMENT '服务器内网ip',
  `out_ip` char(15) DEFAULT NULL COMMENT '服务器外网ip',
  `in_connect` varchar(200) DEFAULT NULL COMMENT '服务器内网接口',
  `out_connect` varchar(200) DEFAULT NULL COMMENT '服务器外网接口',
  `server_status` char(1) DEFAULT NULL COMMENT '服务器状态',
  `create_user_code` varchar(11) DEFAULT NULL COMMENT '创建用户编码',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `un_server_code` (`server_code`) USING BTREE,
  KEY `un_create_user_code` (`create_user_code`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `kb_server` */

/*Table structure for table `kb_user` */

DROP TABLE IF EXISTS `kb_user`;

CREATE TABLE `kb_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id自增',
  `user_code` varchar(11) DEFAULT NULL COMMENT '员工工号',
  `user_name` varchar(12) DEFAULT NULL COMMENT '员工姓名',
  `user_dept_code` char(19) DEFAULT '' COMMENT '部门编号 格式 D+yyyyMMddHHmmss+4位随机数 关联字段',
  `professional_code` char(19) DEFAULT '' COMMENT '职称编码  PR+yyyyMMddHHmmss+3随机数',
  `user_password` char(32) DEFAULT NULL COMMENT '用户密码',
  `user_salt` char(32) DEFAULT NULL COMMENT '随机盐值',
  `user_status` char(1) DEFAULT NULL COMMENT '用户状态   1:正常 2：锁定 3：删除',
  PRIMARY KEY (`id`),
  KEY `un_user_code` (`user_code`) USING BTREE,
  KEY `un_user_dept_code` (`user_dept_code`),
  KEY `un_professional_code` (`professional_code`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

/*Data for the table `kb_user` */

insert  into `kb_user`(`id`,`user_code`,`user_name`,`user_dept_code`,`professional_code`,`user_password`,`user_salt`,`user_status`) values 
(1,'820046','A负责人','D201806230935390372','PR20180623101010123','0880fa2dd1a995a5ebfcbed7d0859f59','66859e155687c7524efe08223df28a84','1'),
(2,'820032','B职员','D201806230935390372','PR20180623101010124','f9ad6a291c393a1af50ffb353bf5a0bc','78b60b5cbb9a8ee089afd995610babba','1'),
(3,'820033','C职员','D201806230935390372','PR20180623101010124','b8dac46317344da0e980dd376d7b654d','fcfbdc52646332df4ad33f661a74333f','1'),
(4,'820055','D职员','D201806230935390372','PR20180623101010124','3e124be0bc73b2caeefd6e61edf5898e','dee2203e4ff0b6d9498d1e9dbf8ee38b','1'),
(5,'820001','X总','D201806230935390370','PR20180623101010123','a3090362b856cc661ca8c10d9f8bcb25','1b541c753235228d4e41f1e46a99f9dc','1'),
(6,'820047','B职员1','D201806230935390372','PR20180623101010124','f9ad6a291c393a1af50ffb353bf5a0bc','78b60b5cbb9a8ee089afd995610babba','1'),
(7,'820048','B职员2','D201806230935390372','PR20180623101010124','f9ad6a291c393a1af50ffb353bf5a0bc','78b60b5cbb9a8ee089afd995610babba','1'),
(8,'820100','测试初始化人员','D201806230935390372','PR20180623101010124','f9ad6a291c393a1af50ffb353bf5a0bc','78b60b5cbb9a8ee089afd995610babba','1');

/*Table structure for table `kb_user_advice` */

DROP TABLE IF EXISTS `kb_user_advice`;

CREATE TABLE `kb_user_advice` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `advice_code` char(19) DEFAULT NULL COMMENT '通知编号',
  `user_code` char(19) DEFAULT NULL COMMENT '用户编码',
  `log_code` char(19) DEFAULT NULL COMMENT '日志编码',
  `log_msg` varchar(255) DEFAULT NULL COMMENT '日志信息',
  `advice_status` char(1) DEFAULT NULL COMMENT '是否已读 已读  Y  未读  N',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=107 DEFAULT CHARSET=utf8;

/*Data for the table `kb_user_advice` */

insert  into `kb_user_advice`(`id`,`advice_code`,`user_code`,`log_code`,`log_msg`,`advice_status`,`create_time`,`update_time`) values 
(3,'ADV2018070913015098','820032','L201807091301509530','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-09 13:01:50','2018-07-14 17:06:45'),
(4,'ADV2018070913015030','820001','L201807091301509530','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-09 13:01:50','2018-07-14 17:06:23'),
(5,'ADV2018070914463509','820032','L201807091446356275','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-09 14:46:35','2018-07-14 17:06:45'),
(6,'ADV2018070914463507','820001','L201807091446356275','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-09 14:46:35','2018-07-14 17:06:23'),
(7,'ADV2018070917020134','820046','L201807091702010933','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-09 17:02:01','2018-07-09 17:02:08'),
(8,'ADV2018070917020161','820032','L201807091702010933','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-09 17:02:01','2018-07-14 17:06:45'),
(9,'ADV2018070917020170','820048','L201807091702010933','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-09 17:02:01','2018-07-09 17:02:08'),
(10,'ADV2018070917020127','820001','L201807091702010933','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-09 17:02:01','2018-07-14 17:06:23'),
(11,'ADV2018071009275457','820046','L201807100927532586','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 09:27:54','2018-07-10 09:28:03'),
(12,'ADV2018071009275427','820032','L201807100927532586','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 09:27:54','2018-07-14 17:06:45'),
(13,'ADV2018071009275471','820048','L201807100927532586','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 09:27:54','2018-07-10 09:28:03'),
(14,'ADV2018071009275416','820001','L201807100927532586','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 09:27:54','2018-07-14 17:06:23'),
(15,'ADV2018071014450890','820046','L201807101445085086','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 14:45:08','2018-07-10 14:45:18'),
(16,'ADV2018071014450859','820032','L201807101445085086','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 14:45:08','2018-07-14 17:06:45'),
(17,'ADV2018071014450879','820048','L201807101445085086','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 14:45:08','2018-07-10 14:45:18'),
(18,'ADV2018071014450854','820001','L201807101445085086','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 14:45:08','2018-07-14 17:06:23'),
(19,'ADV2018071016244315','820046','L201807101624438129','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:24:43','2018-07-10 16:24:53'),
(20,'ADV2018071016244317','820032','L201807101624438129','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:24:43','2018-07-14 17:06:45'),
(21,'ADV2018071016244323','820048','L201807101624438129','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:24:43','2018-07-10 16:24:53'),
(22,'ADV2018071016244302','820001','L201807101624438129','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:24:43','2018-07-14 17:06:23'),
(23,'ADV2018071016281224','820046','L201807101628124461','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:28:12','2018-07-10 16:28:21'),
(24,'ADV2018071016281217','820032','L201807101628124461','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:28:12','2018-07-14 17:06:45'),
(25,'ADV2018071016281234','820048','L201807101628124461','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:28:12','2018-07-10 16:28:21'),
(26,'ADV2018071016281226','820001','L201807101628124461','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:28:12','2018-07-14 17:06:23'),
(27,'ADV2018071016324345','820046','L201807101632438241','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:32:43','2018-07-10 16:32:53'),
(28,'ADV2018071016324374','820032','L201807101632438241','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:32:43','2018-07-14 17:06:45'),
(29,'ADV2018071016324380','820048','L201807101632438241','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:32:43','2018-07-10 16:32:53'),
(30,'ADV2018071016324378','820001','L201807101632438241','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:32:43','2018-07-14 17:06:23'),
(31,'ADV2018071016424747','820046','L201807101642470020','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:42:47','2018-07-10 16:42:57'),
(32,'ADV2018071016424749','820032','L201807101642470020','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:42:47','2018-07-14 17:06:45'),
(33,'ADV2018071016424702','820048','L201807101642470020','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:42:47','2018-07-10 16:42:57'),
(34,'ADV2018071016424788','820001','L201807101642470020','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:42:47','2018-07-14 17:06:23'),
(35,'ADV2018071016570235','820046','L201807101657021558','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:57:02','2018-07-10 16:57:12'),
(36,'ADV2018071016570223','820032','L201807101657021558','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:57:02','2018-07-14 17:06:45'),
(37,'ADV2018071016570237','820048','L201807101657021558','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 16:57:02','2018-07-10 16:57:12'),
(38,'ADV2018071016570250','820001','L201807101657021558','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 16:57:02','2018-07-14 17:06:23'),
(39,'ADV2018071017000246','820046','L201807101700023373','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 17:00:02','2018-07-10 17:00:12'),
(40,'ADV2018071017000207','820032','L201807101700023373','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-10 17:00:02','2018-07-31 10:19:13'),
(41,'ADV2018071017000298','820048','L201807101700023373','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 17:00:02','2018-07-10 17:00:12'),
(42,'ADV2018071017000242','820001','L201807101700023373','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-10 17:00:02','2018-07-10 17:00:12'),
(47,'ADV2018071414051837','820046','L201807141405182219','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-14 14:05:18','2018-07-14 14:05:17'),
(48,'ADV2018071414051808','820032','L201807141405182219','B职员,操作了:新增项目表信息及项目员工表信息','Y','2018-07-14 14:05:18','2018-07-31 10:19:13'),
(49,'ADV2018071414051891','820048','L201807141405182219','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-14 14:05:18','2018-07-14 14:05:17'),
(50,'ADV2018071414051882','820001','L201807141405182219','B职员,操作了:新增项目表信息及项目员工表信息','N','2018-07-14 14:05:18','2018-07-14 14:05:17'),
(51,'ADV2018071416153246','820046','L201807141615324346','测试初始化人员,创建项目知识库需求整理','N','2018-07-14 16:15:32','2018-07-14 16:15:30'),
(52,'ADV2018071416153285','820032','L201807141615324346','测试初始化人员,创建项目知识库需求整理','Y','2018-07-14 16:15:32','2018-07-31 10:19:13'),
(53,'ADV2018071416153268','820033','L201807141615324346','测试初始化人员,创建项目知识库需求整理','N','2018-07-14 16:15:32','2018-07-14 16:15:30'),
(54,'ADV2018071416153242','820100','L201807141615324346','测试初始化人员,创建项目知识库需求整理','N','2018-07-14 16:15:32','2018-07-14 16:15:30'),
(55,'ADV2018071416153269','820055','L201807141615324346','测试初始化人员,创建项目知识库需求整理','N','2018-07-14 16:15:32','2018-07-14 16:15:30'),
(56,'ADV2018071416153249','820001','L201807141615324346','测试初始化人员,创建项目知识库需求整理','N','2018-07-14 16:15:32','2018-07-14 16:15:30'),
(57,'ADV2018071416262157','820046','L201807141626219755','测试初始化人员,创建项目【知识库开发模块整理】','N','2018-07-14 16:26:21','2018-07-14 16:26:20'),
(58,'ADV2018071416262161','820032','L201807141626219755','测试初始化人员,创建项目【知识库开发模块整理】','Y','2018-07-14 16:26:21','2018-07-31 10:19:13'),
(59,'ADV2018071416262132','820033','L201807141626219755','测试初始化人员,创建项目【知识库开发模块整理】','N','2018-07-14 16:26:21','2018-07-14 16:26:20'),
(60,'ADV2018071416262115','820100','L201807141626219755','测试初始化人员,创建项目【知识库开发模块整理】','N','2018-07-14 16:26:21','2018-07-14 16:26:20'),
(61,'ADV2018071416262152','820055','L201807141626219755','测试初始化人员,创建项目【知识库开发模块整理】','N','2018-07-14 16:26:21','2018-07-14 16:26:20'),
(62,'ADV2018071416262174','820001','L201807141626219755','测试初始化人员,创建项目【知识库开发模块整理】','N','2018-07-14 16:26:21','2018-07-14 16:26:20'),
(63,'ADV2018071417045724','820046','L201807141704571402','测试初始化人员,新增文件【2018年工作日历.xlsx】','N','2018-07-14 17:04:57','2018-07-14 17:04:56'),
(64,'ADV2018071417045769','820032','L201807141704571402','测试初始化人员,新增文件【2018年工作日历.xlsx】','Y','2018-07-14 17:04:57','2018-07-31 10:19:13'),
(65,'ADV2018071417045701','820033','L201807141704571402','测试初始化人员,新增文件【2018年工作日历.xlsx】','N','2018-07-14 17:04:57','2018-07-14 17:04:56'),
(66,'ADV2018071417045773','820100','L201807141704571402','测试初始化人员,新增文件【2018年工作日历.xlsx】','N','2018-07-14 17:04:57','2018-07-14 17:04:56'),
(67,'ADV2018071417045722','820055','L201807141704571402','测试初始化人员,新增文件【2018年工作日历.xlsx】','N','2018-07-14 17:04:57','2018-07-14 17:04:56'),
(68,'ADV2018071417045730','820001','L201807141704571402','测试初始化人员,新增文件【2018年工作日历.xlsx】','N','2018-07-14 17:04:57','2018-07-14 17:04:56'),
(69,'ADV2018071417084658','820046','L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','N','2018-07-14 17:08:46','2018-07-14 17:08:45'),
(70,'ADV2018071417084611','820032','L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','Y','2018-07-14 17:08:46','2018-07-31 10:19:13'),
(71,'ADV2018071417084636','820033','L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','N','2018-07-14 17:08:46','2018-07-14 17:08:45'),
(72,'ADV2018071417084626','820055','L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','N','2018-07-14 17:08:46','2018-07-14 17:08:45'),
(73,'ADV2018071417084634','820100','L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','N','2018-07-14 17:08:46','2018-07-14 17:08:45'),
(74,'ADV2018071417084651','820047','L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','N','2018-07-14 17:08:46','2018-07-14 17:08:45'),
(75,'ADV2018071417084670','820001','L201807141708467586','测试初始化人员,创建项目【知识库通知模块】','N','2018-07-14 17:08:46','2018-07-14 17:08:45'),
(76,'ADV2018071611122850','820046','L201807161112286041','B职员,创建项目【第三层边界确认】','N','2018-07-16 11:12:28','2018-07-16 11:12:32'),
(77,'ADV2018071611122872','820032','L201807161112286041','B职员,创建项目【第三层边界确认】','Y','2018-07-16 11:12:28','2018-07-31 10:19:13'),
(78,'ADV2018071611122863','820033','L201807161112286041','B职员,创建项目【第三层边界确认】','N','2018-07-16 11:12:28','2018-07-16 11:12:32'),
(79,'ADV2018071611122812','820055','L201807161112286041','B职员,创建项目【第三层边界确认】','N','2018-07-16 11:12:28','2018-07-16 11:12:32'),
(80,'ADV2018071611122811','820047','L201807161112286041','B职员,创建项目【第三层边界确认】','N','2018-07-16 11:12:28','2018-07-16 11:12:32'),
(81,'ADV2018071611122895','820048','L201807161112286041','B职员,创建项目【第三层边界确认】','N','2018-07-16 11:12:28','2018-07-16 11:12:32'),
(82,'ADV2018071611122849','820001','L201807161112286041','B职员,创建项目【第三层边界确认】','N','2018-07-16 11:12:28','2018-07-16 11:12:32'),
(83,'ADV2018071913154087','820046','L201807191315402916','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','N','2018-07-19 13:15:40','2018-07-19 13:15:41'),
(84,'ADV2018071913154017','820032','L201807191315402916','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','Y','2018-07-19 13:15:40','2018-07-31 10:19:13'),
(85,'ADV2018071913154053','820033','L201807191315402916','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','N','2018-07-19 13:15:40','2018-07-19 13:15:41'),
(86,'ADV2018071913154089','820001','L201807191315402916','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','N','2018-07-19 13:15:40','2018-07-19 13:15:41'),
(87,'ADV2018072110370329','820046','L201807211037036118','B职员,新增文件【file_extension_dwg.png】','N','2018-07-21 10:37:03','2018-07-21 10:37:02'),
(88,'ADV2018072110370387','820032','L201807211037036118','B职员,新增文件【file_extension_dwg.png】','Y','2018-07-21 10:37:03','2018-07-31 10:19:13'),
(89,'ADV2018072110370306','820033','L201807211037036118','B职员,新增文件【file_extension_dwg.png】','N','2018-07-21 10:37:03','2018-07-21 10:37:02'),
(90,'ADV2018072110370389','820001','L201807211037036118','B职员,新增文件【file_extension_dwg.png】','N','2018-07-21 10:37:03','2018-07-21 10:37:02'),
(91,'ADV2018073108430949','820046','L201807310843095579','B职员,新增文件【docker_practice.pdf】','N','2018-07-31 08:43:09','2018-07-31 08:43:10'),
(92,'ADV2018073108430940','820032','L201807310843095579','B职员,新增文件【docker_practice.pdf】','Y','2018-07-31 08:43:09','2018-07-31 10:19:13'),
(93,'ADV2018073108430935','820033','L201807310843095579','B职员,新增文件【docker_practice.pdf】','N','2018-07-31 08:43:09','2018-07-31 08:43:10'),
(94,'ADV2018073108430940','820001','L201807310843095579','B职员,新增文件【docker_practice.pdf】','Y','2018-07-31 08:43:09','2018-07-31 10:19:13'),
(95,'ADV2018073110295982','820001','L201807311029593755','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','N','2018-07-31 10:29:59','2018-07-31 10:30:00'),
(96,'ADV2018073110295997','820032','L201807311029593755','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','Y','2018-07-31 10:29:59','2018-07-31 10:38:33'),
(97,'ADV2018073110295924','820046','L201807311029593755','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','N','2018-07-31 10:29:59','2018-07-31 10:30:00'),
(98,'ADV2018073110295952','820100','L201807311029593755','B职员,新增文件【2018年7月开发组黄官易日报.pdf】','N','2018-07-31 10:29:59','2018-07-31 10:30:00'),
(99,'ADV2018073110400875','820001','L201807311040084576','B职员,新增文件【2018年7月开发组黄官易日报 (2).pdf】','N','2018-07-31 10:40:08','2018-07-31 10:40:09'),
(100,'ADV2018073110400835','820032','L201807311040084576','B职员,新增文件【2018年7月开发组黄官易日报 (2).pdf】','Y','2018-07-31 10:40:08','2018-07-31 10:43:04'),
(101,'ADV2018073110400846','820046','L201807311040084576','B职员,新增文件【2018年7月开发组黄官易日报 (2).pdf】','N','2018-07-31 10:40:08','2018-07-31 10:40:09'),
(102,'ADV2018073110400886','820100','L201807311040084576','B职员,新增文件【2018年7月开发组黄官易日报 (2).pdf】','N','2018-07-31 10:40:08','2018-07-31 10:40:09'),
(103,'ADV2018073110422463','820001','L201807311042245426','B职员,新增文件【2018年7月开发组黄官易日报 (1).pdf】','N','2018-07-31 10:42:24','2018-07-31 10:42:25'),
(104,'ADV2018073110422404','820032','L201807311042245426','B职员,新增文件【2018年7月开发组黄官易日报 (1).pdf】','Y','2018-07-31 10:42:24','2018-07-31 10:43:04'),
(105,'ADV2018073110422490','820046','L201807311042245426','B职员,新增文件【2018年7月开发组黄官易日报 (1).pdf】','N','2018-07-31 10:42:24','2018-07-31 10:42:25'),
(106,'ADV2018073110422441','820100','L201807311042245426','B职员,新增文件【2018年7月开发组黄官易日报 (1).pdf】','N','2018-07-31 10:42:24','2018-07-31 10:42:25');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
